[
    {
    "text": "THEAETETUSPlato has much to say in other dialogues about knowledge, but this is his only
sustained inquiry into the question ‘What isknowledge?’ As such, it is the
founding document of what has come to be known as ‘epistemology’, as one of
the branches of philosophy; its inﬂuence on Greek epistemology—in Aristotle
and the Stoics particularly—is strongly marked. Theaetetus was a famous
mathematician, Plato’s associate for many years in the Academy; the dialogue’s
prologue seems to announce the work as published in his memory, shortly after
his early death on military service in 369 B.C.We can therefore date the publica-
tion of Theaetetus fairly precisely, to the few years immediately following
Theaetetus’ death. Plato was then about sixty years of age, and another famous
longtime associate, Aristotle, was just joining the Academy as a student (367).
Though it is not counted as a ‘Socratic’ dialogue—one depicting Socrates in-
quiring into moral questions by examining and refuting the opinions of his fel-
low discussants— Theaetetus depicts a Socrates who makes much of his own
ignorance and his subordinate position as questioner, and the dialogue con-
cludes inconclusively. Socrates now describes his role, however, as he does not
in the ‘Socratic’ dialogues, as that of a ‘midwife’: he brings to expression ideas
of clever young men like Theaetetus, extensively develops their presuppositions
and consequences so as to see clearly what the ideas amount to, and then estab-
lishes them as sound or defective by independent arguments of his own. The
ﬁrst of Theaetetus’ three successive deﬁnitions of knowledge—that knowledge is
‘perception’—is not ﬁnally ‘brought to birth’ until Socrates has linked it to Pro-
tagoras’ famous ‘man is the measure’ doctrine of relativistic truth, and also to
the theory that ‘all is motion and change’ that Socrates ﬁnds most Greek think-
ers of the past had accepted, and until he has ﬁtted it out with an elaborate
and ingenious theory of perception and how it works. He then examines sepa-
rately the truth of these linked doctrines—introduced into the discussion by
him, not Theaetetus—and, in ﬁnally rejecting Theaetetus’ idea as unsound, he
advances his own positive analysis of perception and its role in knowledge.
This emphasis on the systematic exploration of ideas before ﬁnally committing
oneself to them or rejecting them as unsound is found in a different guise in
Parmenides, with its systematic exploration of hypotheses about unity as a
means of working hard toward an acceptable theory of Forms. Socrates estab-
lishes a clear link between the two dialogues when, at 183e, he drags in a refer-
ence back to the conversation reported in Parmenides.
Theaetetus has a unique format among Plato’s dialogues. The prologue
gives a brief conversation between Euclides and Terpsion, Socratics from
157158 Theaetetus
nearby Megara (they are among those present for the discussion on Socrates’
last day in Phaedo). For the remainder, a slave reads out a book composed by
Euclides containing a conversation of Socrates, Theodorus, and Theaetetus that
took place many years previously. Since ancient sources tell us of Socratic dia-
logues actually published by Euclides, it is as if, except for the prologue, Plato
is giving us under his own name one of Euclides’ dialogues! The last line of
the work establishes it as the ﬁrst of a series, with Sophist andStatesman to
follow —as noted above, Parmenides precedes. In Theaetetus Socrates tests
Theaetetus’ mettle with the geometer Theodorus’ aid and in the presence of his
namesake Socrates, another associate of Plato’s in the Academy; in the other
two works, ﬁrst Theaetetus, then young Socrates will be discussion partners
with an unnamed visitor from Elea, in Southern Italy, home to Parmenides
and Zeno —a very different type of partner. Socrates and his midwifery are su-
perseded.
Despite its lively and intellectually playful Socrates, reminiscent of the ‘So-
cratic’ dialogues, Theaetetus is a difﬁcult work of abstract philosophical the-
ory. The American logician and philosopher C. S. Peirce counted it, along with
Parmenides, as Plato’s greatest work, and more recently it has attracted favor-
able attention from such major philosophers as Ludwig Wittgenstein and Gil-
bert Ryle.J.M.C.
EUCLIDES : Are you only just in from the country, Terpsion? Or have you 142
been here some time?
TERPSION : I’ve been here a good while. In fact, I have been looking for
you in the market-place and wondering that I couldn’t ﬁnd you.
EUCLIDES : Well, you couldn’t, because I was not in the city.
TERPSION : Where have you been, then?
EUCLIDES : I went down to the harbor; and as I was going, I met Theaetetus,
being taken to Athens from the camp at Corinth.
TERPSION : Alive or dead?
EUCLIDES : Alive; but that’s about all one could say. Badly wounded for b
one thing; but the real trouble is this sickness that has broken out in
the army.
TERPSION : Dysentery?
EUCLIDES : Yes.
TERPSION : What a man to lose!
EUCLIDES : Yes. A ﬁne man, Terpsion. Only just now I was listening to
some people singing his praises for the way he behaved in the battle.
TERPSION : Well, there’s nothing extraordinary about that. Much more to
be wondered at if he hadn’t distinguished himself. But why didn’t he put c
up here at Megara?
Translated by M. J. Levett, revised by Myles Burnyeat.Theaetetus 159
EUCLIDES : He was in a hurry to get home. I kept asking him myself, and
advising him; but he wouldn’t. So I saw him on his way. And as I was
coming back, I thought of Socrates and what a remarkably good prophet
he was —as usual —about Theaetetus. It was not long before his death, if
I remember rightly, that he came across Theaetetus, who was a boy at the
time. Socrates met him and had a talk with him, and was very much struck
with his natural ability; and when I went to Athens, he repeated to me
the discussion they had had, which was well worth listening to. And he d
said to me then that we should inevitably hear more of Theaetetus, if he
lived to grow up.
TERPSION : Well, he appears to have been right enough. —But what was
this discussion? Could you tell it to me?
EUCLIDES : Good Lord, no. Not from memory, anyway. But I made some 143
notes of it at the time, as soon as I got home; then afterwards I recalled
it at my leisure and wrote it out, and whenever I went to Athens, I used
to ask Socrates about the points I couldn’t remember, and correct my
version when I got home. The result is that I have got pretty well the
whole discussion in writing.
TERPSION : Yes, of course. I have heard you say that before, and I have
always been meaning to ask you to show it to me, though I have been so
long about it. But is there any reason why we shouldn’t go through it
now? I want a rest, in any case, after my journey in from the country.
EUCLIDES : Well, I shouldn’t mind sitting down either. I saw Theaetetus as b
faras Erineum.Comealong. Wewillgetthe slavetoread ittous whilewerest.
TERPSION : Right.
EUCLIDES : This is the book, Terpsion. You see, I have written it out like
this: I have not made Socrates relate the conversation as he related it to
me, but I represent him as speaking directly to the persons with whom
he said he had this conversation. (These were, he told me, Theodorus the
geometer and Theaetetus.) I wanted, in the written version, to avoid the c
bother of having the bits of narrative in between the speeches —I mean,
when Socrates, whenever he mentions his own part in the discussion, says
‘And I maintained’ or‘I said,’ or, of the person answering, ‘He agreed’ or
‘He would not admit this.’ That is why I have made him talk directly to
them and have left out these formulae.
TERPSION : Well, that’s quite in order, Euclides.
EUCLIDES : Now, boy, let us have it.
SOCRATES : If Cyrene were ﬁrst in my affections, Theodorus, I should be d
asking you how things are there, and whether any of your young people
are taking up geometry or any other branch of philosophy. But, as it is, I
love Athens better than Cyrene, and so I’m more anxious to know which
of our young men show signs of turning out well. That, of course, is what
I am always trying to ﬁnd out myself, as best I can; and I keep asking
other people too —anyone round whom I see the young men are inclined
to gather. Now you, of course, are very much sought after, and with good160 Theaetetus
reason; your geometry alone entitles you to it, and that is not your only e
claim. So if you have come across anyone worth mentioning, I should be
glad to hear.
THEODORUS : Well, Socrates, I think you ought to be told, and I think I
ought to tell you, about a remarkable boy I have met here, one of your
fellow countrymen. And if he were beautiful, I should be extremely nervous
of speaking of him with enthusiasm, for fear I might be suspected of being
in love with him. But as a matter of fact —if you’ll excuse my saying such
a thing —he is not beautiful at all, but is rather like you, snub-nosed, with
eyes that stick out; though these features are not quite so pronounced in
him. I speak without any qualms; and I assure you that among all the 144
people I have ever met —and I have got to know a good many in my
time —I have never yet seen anyone so amazingly gifted. Along with a
quickness beyond the capacity of most people, he has an unusually gentle
temper; and, to crown it all, he is as manly a boy as any of his fellows. I
never thought such a combination could exist; I don’t see it arising else-
where. People as acute and keen and retentive as he is are apt to be very
unbalanced. They get swept along with a rush, like ships without ballast; b
what stands for courage in their makeup is a kind of mad excitement;
while, on the other hand, the steadier sort of people are apt to come to
their studies with minds that are sluggish, somehow —freighted with a
bad memory. But this boy approaches his studies in a smooth, sure, effective
way, and with great good temper; it reminds one of the quiet ﬂow of a
stream of oil. The result is that it is astonishing to see how he gets through
his work, at his age.
SOCRATES : That is good news. And he is an Athenian —whose son is he?
THEODORUS : I have heard the name, but I don’t remember it. But he is c
the middle one of this group coming toward us. He and his companions
were greasing themselves outside just now; it looks as if they have ﬁnished
and are coming in here. But look and see if you recognize him.
SOCRATES : Yes, I know him. He’s the son of Euphronius of Sunium —
very much the kind of person, my friend, that you tell me his son is. A
distinguished man in many ways; he left a considerable property too. But
I don’t know the boy’s name.
THEODORUS : His name, Socrates, is Theaetetus. As for the property, that, I d
think, has been made away with by trustees. All the same, he is wonderfully
open-handed about money, Socrates.
SOCRATES : A thoroughbred, evidently. I wish you would ask him to come
and sit with us over here.
THEODORUS : All right. Theaetetus, come here beside Socrates.
SOCRATES : Yes, come along, Theaetetus. I want to see for myself what
sort of a face I have. Theodorus says I am like you. But look. If you and e
I had each had a lyre, and Theodorus had told us that they were both
similarly tuned, should we have taken his word for it straightaway? Or
should we have tried to ﬁnd out if he was speaking with any expert
knowledge of music?Theaetetus 161
THEAETETUS : Oh, we should have inquired into that.
SOCRATES : And if we had found that he was a musician, we should have
believed what he said; but if we found he had no such qualiﬁcation, we
should have put no faith in him.
THEAETETUS : Yes, that’s true.
SOCRATES : And now, I suppose, if we are interested in this question of
our faces being alike, we ought to consider whether he is speaking with 145
any knowledge of drawing or not?
THEAETETUS : Yes, I should think so.
SOCRATES : Then is Theodorus an artist?
THEAETETUS : No, not so far as I know.
SOCRATES : Nor a geometer, either?
THEAETETUS : Oh, there’s no doubt about his being that, Socrates.
SOCRATES : And isn’t he also a master of astronomy and arithmetic and
music —of all that an educated man should know?
THEAETETUS : Well, he seems to me to be.
SOCRATES : Then if he asserts that there is some physical resemblance
between us —whether complimenting us or the reverse —one ought not to
pay much attention to him?
THEAETETUS : No, perhaps not.
SOCRATES : But supposing it were the soul of one of us that he was b
praising? Suppose he said one of us was good and wise? Oughtn’t the
one who heard that to be very anxious to examine the object of such praise?
And oughtn’t the other to be very willing to show himself off?
THEAETETUS : Yes, certainly, Socrates.
SOCRATES : Then, my dear Theaetetus, now is the time for you to show
yourself and for me to examine you. For although Theodorus often gives
meﬂattering testimonials for people, both Athenians and foreigners, I
assure you I have never before heard him praise anybody in the way he c
has just praised you.
THEAETETUS : That’s all very well, Socrates; but take care he wasn’t saying
that for a joke.
SOCRATES : That is not Theodorus’ way. Now don’t you try to get out of
what we have agreed upon with the pretence that our friend is joking, or
you may make it necessary for him to give his evidence —since no charge
of perjury is ever likely to be brought against him. So have the pluck to
stand by your agreement.
THEAETETUS : All right, I must, then, if that’s what you’ve decided.
SOCRATES : Tell me now. You are learning some geometry from Theodorus,
I expect?
THEAETETUS : Yes, I am.
SOCRATES : And some astronomy and music and arithmetic? d
THEAETETUS : Well, I’m very anxious to, anyway.
SOCRATES : And so am I, my son —from Theodorus or from anyone who
seems to me to know about these things. But although I get on with them
pretty well in most ways, I have a small difﬁculty, which I think ought to162 Theaetetus
be investigated, with your help and that of the rest of the company. —
Now isn’t it true that to learn is to become wiser1about the thing one
is learning?
THEAETETUS : Yes, of course.
SOCRATES : And what makes men wise, I take it, is wisdom?
THEAETETUS : Yes.
SOCRATES : And is this in any way different from knowledge? e
THEAETETUS : What?
SOCRATES : Wisdom. Isn’t it the things which they know that men are
wise about?
THEAETETUS : Well, yes.
SOCRATES : So knowledge and wisdom will be the same thing?
THEAETETUS : Yes.
SOCRATES : Now this is just where my difﬁculty comes in. I can’t get a
proper grasp of what on earth knowledge really is. Could we manage to 146
put it into words? What do all of you say? Who’ll speak ﬁrst? Anyone
who makes a mistake shall sit down and be Donkey, as the children say
when they are playing ball; and anyone who comes through without a
miss shall be King and make us answer any question he likes. —Well, why
this silence? Theodorus, I hope my love of argument is not making me
forget my manners —just because I’m so anxious to start a discussion and
get us all friendly and talkative together?
THEODORUS : No, no, Socrates —that’s the last thing one could call forget- b
ting your manners. But do make one of the young people answer you. I
am not used to this kind of discussion, and I’m too old to get into the way
of it. But it would be suitable enough for them and they would proﬁt more
by it. For youth can always proﬁt, that’s true enough. So do go on; don’t
let Theaetetus off but ask him some more questions.
SOCRATES : Well, Theaetetus, you hear what Theodorus says. You won’t
want to disobey him, I’m sure; and certainly a wise man shouldn’tb e c
disobeyed by his juniors in matters of this kind —it wouldn’t be at all the
proper thing. Now give me a good frank answer. What do you think
knowledge is?
THEAETETUS : Well, I ought to answer, Socrates, as you and Theodorus
tell me to. In any case, you and he will put me right, if I make a mistake.
SOCRATES : We certainly will, if we can.
THEAETETUS : Then I think that the things Theodorus teaches are knowl-
edge —I mean geometry and the subjects you enumerated just now. Then d
again there are the crafts such as cobbling, whether you take them together
or separately. They must be knowledge, surely.
SOCRATES : That is certainly a frank and indeed a generous answer, my
dear lad. I asked you for one thing and you have given me many; I wanted
something simple, and I have got a variety.
1. The words ‘wise’ and ‘wisdom’ in the argument which begins here represent the
Greek sophos and sophia. The point of the argument will come across more naturally in
English if readers substitute in their mind the words ‘expert’ and ‘expertise’.Theaetetus 163
THEAETETUS : And what does that mean, Socrates?
SOCRATES : Nothing, I dare say. But I’ll tell you what I think. When you
talk about cobbling, you mean just knowledge of the making of shoes?
THEAETETUS : Yes, that’s all I mean by it.
SOCRATES : And when you talk about carpentering, you mean simply the e
knowledge of the making of wooden furniture?
THEAETETUS : Yes, that’s all I mean, again.
SOCRATES : And in both cases you are putting into your deﬁnition what
the knowledge is of?
THEAETETUS : Yes.
SOCRATES : But that is not what you were asked, Theaetetus. You were
not asked to say what one may have knowledge of, or how many branches
of knowledge there are. It was not with any idea of counting these up that
the question was asked; we wanted to know what knowledge itself is. —
Or am I talking nonsense?
THEAETETUS : No, you are perfectly right.
SOCRATES : Now think about this too. Supposing we were asked about 147
some commonplace, everyday thing; for example, what is clay? And sup-
posing we were to answer, ‘clay of the potters’ and‘clay of the stovemakers’
and ‘clay of the brickmakers’, wouldn’t that be absurd of us?
THEAETETUS : Well, perhaps it would.
SOCRATES : Absurd to begin with, I suppose, to imagine that the person
who asked the question would understand anything from our answer
when we say ‘clay’, whether we add that it is dollmakers’ clay or any b
other craftsman’s. Or do you think that anyone can understand the name
of a thing when he doesn’t know what the thing is?
THEAETETUS : No, certainly not.
SOCRATES : And so a man who does not know what knowledge is will
not understand ‘knowledge of shoes’ either?
THEAETETUS : No, he won’t.
SOCRATES : Then a man who is ignorant of what knowledge is will not
understand what cobbling is, or any other craft?
THEAETETUS : That is so.
SOCRATES : So when the question raised is ‘What is knowledge?’, to reply
by naming one of the crafts is an absurd answer; because it points out c
something that knowledge is of when this is not what the question was
about.
THEAETETUS : So it seems.
SOCRATES : Again, it goes no end of a long way round, in a case where,
I take it, a short and commonplace answer is possible. In the question
about clay, for example, it would presumably be possible to make the
simple, commonplace statement that it is earth mixed with liquid, and let
the question of whose clay it is take care of itself.
THEAETETUS : That seems easier, Socrates, now you put it like that. But I
believe you’re asking just the sort of question that occurred to your name- d
sake Socrates here and myself, when we were having a discussion a little
while ago.164 Theaetetus
SOCRATES : And what was that, Theaetetus?
THEAETETUS : Theodorus here was demonstrating to us with the aid of
diagrams a point about powers.2He was showing us that the power of three
square feet and the power of ﬁve square feet are not commensurable in length
with the power of one square foot; and he went on in this way, taking each
case in turn till he came to the power of seventeen square feet; there for some
reason he stopped. So the idea occurred to us that, since the powers were
turning out to be unlimited in number, we might try to collect the powers in
question under one term, which would apply to them all. e
SOCRATES : And did you ﬁnd the kind of thing you wanted?
THEAETETUS : I think we did. But I’d like you to see if it’s all right.
SOCRATES : Go on, then.
THEAETETUS : We divided all numbers into two classes. Any number
which can be produced by the multiplication of two equal numbers, we
compared to a square in shape, and we called this a square or equilat-
eral number.
SOCRATES : Good, so far.
THEAETETUS : Then we took the intermediate numbers, such as three and 148
ﬁve and any number which can’t be produced by multiplication of two
equals but only by multiplying together a greater and a less; a number
such that it is always contained by a greater and a less side. A number of
this kind we compared to an oblong ﬁgure, and called it an oblong number.
SOCRATES : That’s excellent. But how did you go on?
THEAETETUS :W ed e ﬁned under the term ‘length’ any line which produces
in square an equilateral plane number; while any line which produces in
square an oblong number we deﬁned under the term ‘power’, for the
reason that although it is incommensurable with the former in length, it b
is commensurable in the plane ﬁgures which they respectively have the
2.‘Powers’ is a mathematical term for squares. By contrast, at 148a –b‘power’ is given
a new, specially deﬁned use to denominate a species of line, viz. the incommensurable
lines for which the boys wanted a general account. It may be useful to give a brief
explanation of the mathematics of the passage.
Two lines are incommensurable if and only if they have no common measure; that
is, no unit of length will measure both without remainder. Two squares are incommensu-
rable in length if and only if their sides are incommensurable lines; the areas themselves
may still be commensurable, i.e., both measurable by some unit of area, as is mentioned
at 148b. When Theodorus showed for a series of powers (squares) that each is incommen-
surable in length with the one foot (unit) square, we can think of him as proving case
by case the irrationality of √3,√5 ,...√17. But this was not how he thought of it himself.
Greek mathematicians did not recognize irrational numbers but treated of irrational
quantities as geometrical entities: in this instance, lines identi ﬁed by the areas of the
squares that can be constructed on them. Similarly, we can think of the boys’ formula
for powers or square lines at 148a –b as making the point that, for any positive integer
n,√nis irrational if and only if there is no positive integer msuch that n=m ×m. But,
once again, a Greek mathematician would think of this generalization in the geometrical
terms in which Theaetetus expounds it.Theaetetus 165
power to produce. And there is another distinction of the same sort with
regard to solids.
SOCRATES : Excellent, my boys. I don’t think Theodorus is likely to be
had up for false witness.
THEAETETUS : And yet, Socrates, I shouldn’t be able to answer your ques-
tion about knowledge in the same way that I answered the one about
lengths and powers —though you seem to me to be looking for something
of the same sort. So Theodorus turns out a false witness after all.
SOCRATES : Well, but suppose now it was your running he had praised; c
suppose he had said that he had never met anyone among the young
people who was such a runner as you. And then suppose you were beaten
by the champion runner in his prime —would you think Theodorus’ praise
had lost any of its truth?
THEAETETUS : No, I shouldn’t.
SOCRATES : But do you think the discovery of what knowledge is is really
what I was saying just now —a small thing? Don’t you think that’sa
problem for the people at the top?
THEAETETUS : Yes, rather, I do; and the very topmost of them.
SOCRATES : Then do have conﬁdence in yourself and try to believe that
Theodorus knew what he was talking about. You must put your whole d
heart into what we are doing —in particular into this matter of getting a
statement of what knowledge really is.
THEAETETUS : If putting one’s heart into it is all that is required, Socrates,
the answer will come to light.
SOCRATES : Go on, then. You gave us a good lead just now. Try to imitate
your answer about the powers. There you brought together the many
powers within a single form; now I want you in the same way to give one
single account of the many branches of knowledge.
THEAETETUS : But I assure you, Socrates, I have often tried to think this e
out, when I have heard reports of the questions you ask. But I can never
persuade myself that anything I say will really do; and I never hear anyone
else state the matter in the way that you require. And yet, again, you
know, I can’t even stop worrying about it.
SOCRATES : Yes; those are the pains of labor, dear Theaetetus. It is because
you are not barren but pregnant.
THEAETETUS : I don’t know about that, Socrates. I’m only telling you
what’s happened to me.
SOCRATES : Then do you mean to say you’ve never heard about my being 149
the son of a good hefty midwife, Phaenarete?3
THEAETETUS : Oh, yes, I’ve heard that before.
SOCRATES : And haven’t you ever been told that I practice the same
art myself?
THEAETETUS : No, I certainly haven’t.
3. The name means ‘She who brings virtue to light’.166 Theaetetus
SOCRATES : But I do, believe me. Only don’t give me away to the rest of
the world, will you? You see, my friend, it is a secret that I have this art.
That is not one of the things you hear people saying about me, because
they don’t know; but they do say that I am a very odd sort of person, always
causing people to get into difﬁculties. You must have heard that, surely?
THEAETETUS : Yes, I have. b
SOCRATES : And shall I tell you what is the explanation of that?
THEAETETUS : Yes, please do.
SOCRATES : Well, if you will just think of the general facts about the
business of midwifery, you will see more easily what I mean. You know,
I suppose, that women never practice as midwives while they are still
conceiving and bearing children themselves. It is only those who are past
child-bearing who take this up.
THEAETETUS : Oh, yes.
SOCRATES : They say it was Artemis who was responsible for this custom;
it was because she, who undertook the patronage of childbirth, was herself c
childless. She didn’t, it’s true, entrust the duties of midwifery to barren
women, because human nature is too weak to acquire skill where it has
no experience. But she assigned the task to those who have become incapa-
ble of child-bearing through age —honoring their likeness to herself.
THEAETETUS : Yes, naturally.
SOCRATES : And this too is very natural, isn’t it? —or perhaps necessary?
I mean that it is the midwives who can tell better than anyone else whether
women are pregnant or not.
THEAETETUS : Yes, of course.
SOCRATES : And then it is the midwives who have the power to bring on d
the pains, and also, if they think ﬁt, to relieve them; they do it by the use
of simple drugs, and by singing incantations. In difﬁcult cases, too, they
can bring about the birth; or, if they consider it advisable, they can promote
a miscarriage.
THEAETETUS : Yes, that is so.
SOCRATES : There’s another thing too. Have you noticed this about them,
that they are the cleverest of match-makers, because they are marvellously
knowing about the kind of couples whose marriage will produce the
best children?
THEAETETUS : No, that is not at all familiar to me.
SOCRATES : But they are far prouder of this, believe me, than of cutting
the umbilical cord. Think now. There’s an art which is concerned with the e
cultivation and harvesting of the crops. Now is it the same art which
prescribes the best soil for planting or sowing a given crop? Or is it a
different one?
THEAETETUS : No, it is all the same art.
SOCRATES : Then applying this to women, will there be one art of the
sowing and another of the harvesting?
THEAETETUS : That doesn’t seem likely, certainly.Theaetetus 167
SOCRATES : No, it doesn’t. But there is also an unlawful and unscientiﬁc 150
practice of bringing men and women together, which we call procuring;
and because of that the midwives —a most august body of women —are
very reluctant to undertake even lawful matchmaking. They are afraid
that if they practice this, they may be suspected of the other. And yet, I
suppose, reliable matchmaking is a matter for no one but the true midwife.
THEAETETUS : Apparently.
SOCRATES : So the work of the midwives is a highly important one; but
it is not so important as my own performance. And for this reason, that
there is not in midwifery the further complication, that the patients are b
sometimes delivered of phantoms and sometimes of realities, and that the
two are hard to distinguish. If there were, then the midwife’s greatest and
noblest function would be to distinguish the true from the false offspring —
don’t you agree?
THEAETETUS : Yes, I do.
SOCRATES : Now my art of midwifery is just like theirs in most respects.
The difference is that I attend men and not women, and that I watch over
the labor of their souls, not of their bodies. And the most important thing c
about my art is the ability to apply all possible tests to the offspring, to
determine whether the young mind is being delivered of a phantom, that
is, an error, or a fertile truth. For one thing which I have in common with
the ordinary midwives is that I myself am barren of wisdom. The common
reproach against me is that I am always asking questions of other people
but never express my own views about anything, because there is no
wisdom in me; and that is true enough. And the reason of it is this, that
God compels me to attend the travail of others, but has forbidden me to
procreate. So that I am not in any sense a wise man; I cannot claim as the d
child of my own soul any discovery worth the name of wisdom. But with
those who associate with me it is different. At ﬁrst some of them may give
the impression of being ignorant and stupid; but as time goes on and our
association continues, all whom God permits are seen to make progress —
a progress which is amazing both to other people and to themselves. And
yet it is clear that this is not due to anything they have learned from me;
it is that they discover within themselves a multitude of beautiful things,
which they bring forth into the light. But it is I, with God’s help, who
deliver them of this offspring. And a proof of this may be seen in the e
many cases where people who did not realize this fact took all the credit
to themselves and thought that I was no good. They have then proceeded
to leave me sooner than they should, either of their own accord or through
the inﬂuence of others. And after they have gone away from me they have
resorted to harmful company, with the result that what remained within
them has miscarried; while they have neglected the children I helped them
to bring forth, and lost them, because they set more value upon lies and
phantoms than upon the truth; ﬁnally they have been set down for ignorant
fools, both by themselves and by everybody else. One of these people was 151168 Theaetetus
Aristides the son of Lysimachus;4and there have been very many others.
Sometimes they come back, wanting my company again, and ready to
move heaven and earth to get it. When that happens, in some cases the
divine sign that visits me forbids me to associate with them; in others, it
permits me, and then they begin again to make progress.
There is another point also in which those who associate with me are
like women in child-birth. They suffer the pains of labor, and are ﬁlled
day and night with distress; indeed they suffer far more than women. And
this pain my art is able to bring on, and also to allay.
Well, that’s what happens to them; but at times, Theaetetus, I come b
across people who do not seem to me somehow to be pregnant. Then I
realize that they have no need of me, and with the best will in the world
I undertake the business of match-making; and I think I am good enough —
God willing —at guessing with whom they might proﬁtably keep company.
Many of them I have given away to Prodicus;5and a great number also
to other wise and inspired persons.
Well, my dear lad, this has been a long yarn; but the reason was that I
have a suspicion that you (as you think yourself) are pregnant and in
labor. So I want you to come to me as to one who is both the son of a c
midwife and himself skilled in the art; and try to answer the questions I
shall ask you as well as you can. And when I examine what you say, I
may perhaps think it is a phantom and not truth, and proceed to take it
quietly from you and abandon it. Now if this happens, you mustn’t get
savage with me, like a mother over her ﬁrst-born child. Do you know,
people have often before now got into such a state with me as to be literally
ready to bite when I take away some nonsense or other from them. They
never believe that I am doing this in all goodwill; they are so far from
realizing that no God can wish evil to man, and that even I don’t do this d
kind of thing out of malice, but because it is not permitted to me to accept
a lie and put away truth.
So begin again, Theaetetus, and try to say what knowledge is. And don’t
on any account tell me that you can’t. For if God is willing, and you play
the man, you can.
THEAETETUS : Well, Socrates, after such encouragement from you, it would
hardly be decent for anyone not to try his hardest to say what he has in e
him. Very well then. It seems to me that a man who knows something
perceives what he knows, and the way it appears at present, at any rate,
is that knowledge is simply perception.
SOCRATES : There’s a good frank answer, my son. That’s the way to speak
one’s mind. But come now, let us look at this thing together, and see
whether what we have here is really fertile or a mere wind-egg. You hold
that knowledge is perception?
4. Aristides is one of the two young men whose education Socrates discusses in Laches
(see 178a –179b).
5. A famous Sophist. See Protagoras 315d, 337a –c, 340e –341c, 358a –b.Theaetetus 169
THEAETETUS : Yes.
SOCRATES : But look here, this is no ordinary account of knowledge you’ve
come out with: it’s what Protagoras used to maintain. He said the very 152
same thing, only he put it in rather a different way. For he says, you know,
that ‘Man is the measure of all things: of the things which are, that they
are, and of the things which are not, that they are not.’ You have read
this, of course?
THEAETETUS : Yes, often.
SOCRATES : Then you know that he puts it something like this, that as
each thing appears to me, so it is for me, and as it appears to you, so it
is for you —you and I each being a man?
THEAETETUS : Yes, that is what he says.
SOCRATES : Well, it is not likely that a wise man would talk nonsense. So b
let us follow him up. Now doesn’t it sometimes happen that when the
same wind is blowing, one of us feels cold and the other not? Or that one
of us feels rather cold and the other very cold?
THEAETETUS : That certainly does happen.
SOCRATES : Well then, in that case are we going to say that the wind itself,
by itself, is cold or not cold? Or shall we listen to Protagoras, and say it
is cold for the one who feels cold, and for the other, not cold?
THEAETETUS : It looks as if we must say that.
SOCRATES : And this is how it appears to each of us?
THEAETETUS : Yes.
SOCRATES : But this expression ‘it appears’ means ‘he perceives it’?
THEAETETUS : Yes, it does.
SOCRATES : The appearing of things, then, is the same as perception, in c
the case of hot and things like that. So it results, apparently, that things
are for the individual such as he perceives them.
THEAETETUS : Yes, that seems all right.
SOCRATES : Perception, then, is always of what is, and unerring —as be-
ﬁts knowledge.
THEAETETUS : So it appears.
SOCRATES : But, I say, look here. Was Protagoras one of those omniscient
people? Did he perhaps put this out as a riddle for the common crowd of
us, while he revealed the Truth6as a secret doctrine to his own pupils?
THEAETETUS : What do you mean by that, Socrates? d
SOCRATES :I’ll tell you; and this, now, is certainly no ordinary theory —
I mean the theory that there is nothing which in itself is just one thing:
nothing which you could rightly call anything or any kind of thing. If you
call a thing large, it will reveal itself as small, and if you call it heavy, it
is liable to appear as light, and so on with everything, because nothing is
one or anything or any kind of thing. What is really true, is this: the things
of which we naturally say that they ’are’, are in process of coming to be, e
6. Protagoras of Abdera was a ﬁfth century B.C.philosopher and sophist; this appears
to have been the title of his book.170 Theaetetus
as the result of movement and change and blending with one another. We
are wrong when we say they ‘are’, since nothing ever is, but everything
is coming to be.
And as regards this point of view, let us take it as a fact that all the
wise men of the past, with the exception of Parmenides, stand together.
Let us take it that we ﬁnd on this side Protagoras and Heraclitus and
Empedocles; and also the masters of the two kinds of poetry, Epicharmus
in comedy and Homer in tragedy.7For when Homer talked about ‘Ocean,
begetter of gods, and Tethys their mother’, he made all things the offspring
ofﬂux and motion.8—Or don’t you think he meant that?
THEAETETUS : Oh, I think he did.
SOCRATES : And if anyone proceeded to dispute the ﬁeld with an army 153
like that —an army led by Homer —he could hardly help making a fool of
himself, could he?
THEAETETUS : It would not be an easy matter, Socrates.
SOCRATES : It would not, Theaetetus. You see, there is good enough evi-
dence for this theory that being (what passes for such) and becoming are
a product of motion, while not-being and passing-away result from a state
of rest. There is evidence for it in the fact that heat or ﬁre, which presumably
generates and controls everything else, is itself generated out of movement
and friction —these being motions. —Or am I wrong in saying these are
the original sources of ﬁre?
THEAETETUS : Oh no, they certainly are. b
SOCRATES : Moreover, the growth of living creatures depends upon these
same sources?
THEAETETUS : Yes, certainly.
SOCRATES : And isn’t it also true that bodily condition deteriorates with
rest and idleness? While by exertion and motion it can be preserved for
a long time?
THEAETETUS : Yes.
SOCRATES : And what about the condition of the soul? Isn’t it by learning
and study, which are motions, that the soul gains knowledge and is pre-
served9and becomes a better thing? Whereas in a state of rest, that is, c
when it will not study or learn, it not only fails to acquire knowledge but
forgets what it has already learned?
7. Heraclitus was famous for holding that ‘everything ﬂows’ (cf. 179d ff.). Empedocles
described a cosmic cycle in which things are constituted and dissolved by the coming
together and separating of the four elements earth, air, ﬁre, and water. Epicharmus made
humorous use of the idea that everything is always changing by having a debtor claim
he is not the same person as incurred the debt. Parmenides remains outside the chorus
of agreement because he held that the only reality is one single, completely changeless
thing (cf. 183e).
8.Iliad xiv.201, 302.
9. The Greek could equally be translated ‘that the soul gains and preserves knowledge’;
the reader may perhaps be expected to hear the clause both ways.Theaetetus 171
THEAETETUS : That certainly is so.
SOCRATES : And so we may say that the one thing, that is, motion, is
beneﬁcial to both body and soul, while the other has the opposite effect?
THEAETETUS : Yes, that’s what it looks like.
SOCRATES : Yes, and I might go on to point out to you the effect of such
conditions as still weather on land and calms on the sea. I might show you
how these conditions rot and destroy things, while the opposite conditions
make for preservation. And ﬁnally, to put the crown on my argument, I
might bring in Homer’s golden cord,10and maintain that he means by this
simply the sun; and is here explaining that so long as the revolution d
continues and the sun is in motion, all things are and are preserved, both
in heaven and in earth, but that if all this should be ‘bound fast’,a si t
were, and come to a standstill, all things would be destroyed and, as the
saying goes, the world would be turned upside down. Do you agree
with this?
THEAETETUS : Yes, Socrates, I think that is the meaning of the passage.
SOCRATES : Then, my friend, you must understand our theory in this way.
In the sphere of vision, to begin with, what you would naturally call a
white color is not itself a distinct entity, either outside your eyes or in e
your eyes. You must not assign it any particular place; for then, of course
it would be standing at its post; it wouldn’t be in process of becoming.
THEAETETUS : But what do you mean?
SOCRATES : Let us follow what we stated a moment ago, and posit that
there is nothing which is, in itself, one thing. According to this theory,
black or white or any other color will turn out to have come into being
through the impact of the eye upon the appropriate motion; and what we
naturally call a particular color is neither that which impinges nor that 154
which is impinged upon, but something which has come into being be-
tween the two, and which is private to the individual percipient. —Or
would you be prepared to insist that every color appears to a dog, or to
any other animal, the same as it appears to you?
THEAETETUS : No, I most certainly shouldn’t.
SOCRATES : Well, and do you even feel sure that anything appears to
another human being like it appears to you? Wouldn’t you be much more
disposed to hold that it doesn’t appear the same even to yourself because
you never remain like yourself?
THEAETETUS : Yes, that seems to me nearer the truth than the other.
SOCRATES : Well now, supposing such things as size or warmth or white- b
ness really belonged to the object we measure ourselves against or touch,
it would never be found that this object had become different simply by
coming into contact with another thing and without any change in itself.
On the other hand, if you suppose them to belong to what is measuring
10.Iliad viii.17 –27. Zeus boasts that if he pulled on a golden cord let down from heaven,
he could haul up earth, sea and all, bind the cord fast round the peak of Mt. Olympus,
and leave the lot dangling in mid-air.172 Theaetetus
or touching, this again could never become different simply because some-
thing else had come into its neighborhood, or because something had
happened to the ﬁrst thing —nothing having happened to itself. As it is,
you see, we may easily ﬁnd ourselves forced into saying the most astonish-
ing and ridiculous things, as Protagoras would point out or anyone who
undertook to expound the same views.
THEAETETUS : What do you mean? What sort of ridiculous things?
SOCRATES : Let me give you a simple example of what I mean, and you c
will see the rest for yourself. Here are six dice. Put four beside them, and
they are more, we say, than the four, that is, half as many again; but put
twelve beside them, and we say they are less, that is, half the number.
And there is no getting out of that —or do you think there is?
THEAETETUS : No, I don’t.
SOCRATES : Well now, supposing Protagoras or anyone else were to ask
you this question: ‘Is it possible, Theaetetus, for any thing to become bigger
or more in number in any other way than by being increased?’ What is d
your answer to that?
THEAETETUS : Well, Socrates, if I answer what seems true in relation to
the present question, I shall say ‘No, it is not possible’; but if I consider
it in relation to the question that went before, then in order to avoid
contradicting myself, I say ‘Yes, it is.’
SOCRATES : That’s a good answer, my friend, by Jove it is; you are inspired.
But, I think, if you answer ‘Yes’, it will be like that episode in Euripides —
the tongue will be safe from refutation but the mind will not.11
THEAETETUS : That’s true.
SOCRATES : Now if you and I were professional savants, who had already
analyzed all the contents of our minds, we should now spend our super-
ﬂuous time trying each other out; we should start a regular Sophists ’set- e
to, with a great clashing of argument on argument. But, as it is, we are
only plain men; and so our ﬁrst aim will be to look at our thoughts
themselves in relation to themselves, and see what they are —whether, in
our opinion, they agree with one another or are entirely at variance.
THEAETETUS : That would certainly be my aim, anyway.
SOCRATES : And mine. That being so, as we are not in any way pressed
for time, don’t you think the thing to do is to reconsider this matter quietly 155
and patiently, in all seriousness ‘analyzing’ ourselves, and asking what
are these apparitions within us? —And when we come to review them, I
suppose we may begin with the statement that nothing can possibly have
become either greater or less, in bulk or in number, so long as it is equal
to itself. Isn’t that so?
THEAETETUS : Yes.
SOCRATES : Secondly, we should say that a thing to which nothing is added
and from which nothing is taken away neither increases nor diminishes but
remains equal.
11. Cf. Hippolytus 612.Theaetetus 173
THEAETETUS : Yes, certainly.
SOCRATES : Thirdly, that it is impossible that a thing should ever be b
what it was not before without having become and without any process
of becoming?
THEAETETUS : Yes, I think so.
SOCRATES : Now it seems to me that these three statements that we have
admitted are ﬁghting one another in our souls when we speak of the
example of the dice; or when we say that, within the space of a year, I (a
full-grown man) without having been either increased or diminished, am
now bigger than you (who are only a boy) and, later on, smaller —though
I have lost nothing and it is only that you have grown. For this means c
that I am, at a later stage, what I was not before, and that, too, without
having become —for without becoming it is not possible to have become,
and without suffering any loss in size I could never become less. And
there are innumerable other examples of the same thing if once we admit
these. You follow me, I take it, Theaetetus —I think you must be familiar
with this kind of puzzle.
THEAETETUS : Oh yes, indeed, Socrates, I often wonder like mad what
these things can mean; sometimes when I’m looking at them I begin to
feel quite giddy.
SOCRATES : I dare say you do, my dear boy. It seems that Theodorus was d
not far from the truth when he guessed what kind of person you are. For
this is an experience which is characteristic of a philosopher, this wonder-
ing: this is where philosophy begins and nowhere else. And the man who
made Iris the child of Thaumas was perhaps no bad genealogist.12—But
aren’t you beginning to see now what is the explanation of these puzzles,
according to the theory which we are attributing to Protagoras?
THEAETETUS : I don’t think I am, yet.
SOCRATES : Then I dare say you will be grateful to me if I help you to e
discover the veiled truth in the thought of a great man —or perhaps I
should say, of great men?
THEAETETUS : Of course I shall be, Socrates, very grateful.
SOCRATES : Then you have a look round, and see that none of the uniniti-
ated are listening to us —I mean the people who think that nothing exists
but what they can grasp with both hands; people who refuse to admit
that actions and processes and the invisible world in general have any
place in reality.
THEAETETUS : They must be tough, hard fellows, Socrates. 156
SOCRATES : They are, my son —very crude people. But these others, whose
mysteries I am going to tell you, are a much more subtle type. These
mysteries begin from the principle on which all that we have just been
saying also depends, namely, that everything is really motion, and there
is nothing but motion. Motion has two forms, each an inﬁnite multitude,
12.Theogony 265. ‘Thaumas’ means wonder, while Iris, the messenger of the gods, is
the rainbow which passes between earth and heaven.174 Theaetetus
but distinguished by their powers, the one being active and the other
passive. And through the intercourse and mutual friction of these two
there comes to be an offspring inﬁnite in multitude but always twin births, b
on the one hand what is perceived, on the other, the perception of it, the
perception in every case being generated together with what is perceived
and emerging along with it. For the perceptions we have such names as
sight, hearing, smelling, feeling cold and feeling hot; also what are called
pleasures and pains, desires and fears; and there are others besides, a great
number which have names, an inﬁnite number which have not. And on
the other side there is the race of things perceived, for each of these
perceptions perceived things born of the same parentage, for all kinds of c
visions all kinds of colors, for all kinds of hearings all kinds of sounds;
and so on, for the other perceptions the other things perceived, that come
to be in kinship with them.
Now what does this tale really mean, from our point of view, Theaetetus?
How does it bear on what we were saying before? Do you see?
THEAETETUS : Not really, Socrates.
SOCRATES : Look here, then, let us see if we can somehow round it off.
What it is trying to express, presumably, is this. All these things are in
motion, just as we say; and their motion is distinguished by its swiftness
or slowness. What is slow has its motion in one and the same place, and
in relation to the things in the immediate neighborhood; in this way it d
generates and the offspring are swifter, as they move through space, and
their motion takes the form of spatial movement.
Thus the eye and some other thing —one of the things commensurate
with the eye —which has come into its neighborhood, generate both white-
ness and the perception which is by nature united with it (things which
would never have come to be if it had been anything else that eye or object
approached). In this event, motions arise in the intervening space, sight e
from the side of the eye and whiteness from the side of that which cooper-
ates in the production of the color. The eye is ﬁlled with sight; at that
moment it sees, and becomes not indeed sight, but a seeing eye; while its
partner in the process of producing color is ﬁlled with whiteness, and
becomes not whiteness but white, a white stick or stone or whatever it is
that happens to be colored this sort of color.
We must understand this account as applying in the same way to hard 157
and hot and everything else: nothing, as we were saying before, isin itself
any of these. All of them, of all kinds whatsoever, are what things become
through association with one another, as the result of motion. For even in
the case of the active and passive motions it is impossible, as they say, for
thought, taking them singly, to pin them down to being anything. There
is no passive till it meets the active, no active except in conjunction with
the passive; and what, in conjunction with one thing, is active, reveals
itself as passive when it falls in with something else.
And so, wherever you turn, there is nothing, as we said at the outset,
which in itself is just one thing; all things become relatively to something. bTheaetetus 175
The verb ‘to be’ must be totally abolished —though indeed we have been
led by habit and ignorance into using it ourselves more than once, even
in what we have just been saying. That is wrong, these wise men tell us,
nor should we allow the use of such words as ‘something’, ‘of something’,
or‘mine’, ‘this’ or‘that’, or any other name that makes things stand still.
We ought, rather, to speak according to nature and refer to things as
‘becoming’, ‘being produced’, ‘passing away’, ‘changing’; for if you speak
in such a way as to make things stand still, you will easily be refuted.
And this applies in speaking both of the individual case and of many
aggregated together —such an aggregate, I mean, as people call ‘man’ or c
‘stone’, or to which they give the names of the different animals and sorts
of thing.
—Well, Theaetetus, does this look to you a tempting meal and could
you take a bite of the delicious stuff?
THEAETETUS : I really don’t know, Socrates. I can’t even quite see what
you’re getting at —whether the things you are saying are what you think
yourself, or whether you are just trying me out.
SOCRATES : You are forgetting, my friend. I don’t know anything about
this kind of thing myself, and I don’t claim any of it as my own. I am
barren of theories; my business is to attend you in your labor. So I chant
incantations over you and offer you little tidbits from each of the wise till d
I succeed in assisting you to bring your own belief forth into the light.
When it has been born, I shall consider whether it is fertile or a wind-egg.
But you must have courage and patience; answer like a man whatever
appears to you about the things I ask you.
THEAETETUS : All right, go on with the questions.
SOCRATES : Tell me again, then, whether you like the suggestion that good
and beautiful and all the things we were just speaking of cannot be said
to‘be’ anything, but are always ‘coming to be’.13
THEAETETUS : Well, as far as I’m concerned, while I’m listening to your
exposition of it, it seems to me an extraordinarily reasonable view; and I
feel that the way you have set out the matter has got to be accepted.
SOCRATES : In that case, we had better not pass over any point where our e
theory is still incomplete. What we have not yet discussed is the question
of dreams, and of insanity and other diseases; also what is called mishearing
or misseeing or other cases of misperceiving. You realize, I suppose, that
it would be generally agreed that all these cases appear to provide a
refutation of the theory we have just expounded. For in these conditions, 158
we surely have false perceptions. Here it is far from being true that all
things which appear to the individual also are. On the contrary, no one
of the things which appear to him really is.
THEAETETUS : That is perfectly true, Socrates.
13. An alternative translation would be: ‘the suggestion that nothing is, but rather
becomes, good, beautiful or any of the things we were speaking of just now ’.176 Theaetetus
SOCRATES : Well then, my lad, what argument is left for the person who
maintains that knowledge is perception and that what appears to any
individual also is, for him to whom it appears to be?
THEAETETUS : Well, Socrates, I hardly like to tell you that I don’t know
what to say, seeing I’ve just got into trouble with you for that. But I really b
shouldn’t know how to dispute the suggestion that a madman believes
what is false when he thinks he is a god; or a dreamer when he imagines
he has wings and is ﬂying in his sleep.
SOCRATES : But there’s a point here which isa matter of dispute, especially
as regards dreams and real life —don’t you see?
THEAETETUS : What do you mean?
SOCRATES : There’s a question you must often have heard people ask —
the question what evidence we could offer if we were asked whether in
the present instance, at this moment, we are asleep and dreaming all our c
thoughts, or awake and talking to each other in real life.
THEAETETUS : Yes, Socrates, it certainly is difﬁcult to ﬁnd the proof we
want here. The two states seem to correspond in all their characteristics.
There is nothing to prevent us from thinking when we are asleep that we
are having the very same discussion that we have just had. And when we
dream that we are telling the story of a dream, there is an extraordinary
likeness between the two experiences.
SOCRATES : You see, then, it is not difﬁcult to ﬁnd matter for dispute,
when it is disputed even whether this is real life or a dream. Indeed we d
may say that, as our periods of sleeping and waking are of equal length,
and as in each period the soul contends that the beliefs of the moment are
preeminently true, the result is that for half our lives we assert the reality
of the one set of objects, and for half that of the other set. And we make
our assertions with equal conviction in both cases.
THEAETETUS : That certainly is so.
SOCRATES : And doesn’t the same argument apply in the cases of disease
and madness, except that the periods of time are not equal?
THEAETETUS : Yes, that is so.
SOCRATES : Well now, are we going to ﬁx the limits of truth by the clock?
THEAETETUS : That would be a very funny thing to do. e
SOCRATES : But can you produce some other clear indication to show
which of these beliefs are true?
THEAETETUS : I don’t think I can.
SOCRATES : Then you listen to me and I’ll tell you the kind of thing that
might be said by those people who propose it as a rule that whatever a
man thinks at any time is the truth for him. I can imagine them putting
their position by asking you this question: ‘Now, Theaetetus, suppose you
have something which is an entirely different thing from something else.
Can it have in any respect the same powers as the other thing? ’And
observe, we are not to understand the question to refer to something which
is the same in some respects while it is different in others, but to that
which is wholly different.Theaetetus 177
THEAETETUS : In that case, then, it is impossible that it should have any- 159
thing the same, either as regards its powers or in any other respect, if it
is a completely different thing.
SOCRATES : And aren’t we obliged to admit that such a thing is also unlike
the other?
THEAETETUS : Yes, I think so.
SOCRATES : Now supposing a thing is coming to be like or unlike to
something, whether to itself or to something else; are we to say that when
it is growing like it is coming to be the same, and when it is growing
unlike it is coming to be a different thing?
THEAETETUS : Yes, that must be so.
SOCRATES : Now weren’t we saying, at an earlier stage, that there is a
number —indeed an inﬁnite number —of both active and passive factors?
THEAETETUS : Yes.
SOCRATES : Also this, that when a thing mixes now with one thing and
now with another, it will not generate the same things each time but
different things?
THEAETETUS : Yes, certainly. b
SOCRATES : Well, now let us apply this same statement to you and me
and things in general. Take, for example, Socrates ill and Socrates well.
Shall we say Socrates in health is like or unlike Socrates in sickness?
THEAETETUS : You mean the ill Socrates as a whole compared with the
well Socrates as a whole?
SOCRATES : You get my point excellently; that is just what I mean.
THEAETETUS : Unlike, then, I suppose.
SOCRATES : And different also, in so far as he is unlike?
THEAETETUS : Yes, that follows.
SOCRATES : Similarly, you would say, when he is asleep or in any of the c
conditions we enumerated just now?
THEAETETUS : Yes, I should.
SOCRATES : Then it must surely be true that, when any one of the naturally
active factors ﬁnds Socrates well, it will be dealing with one me, and when
itﬁnds Socrates ill, with a different me?
THEAETETUS : Yes, surely.
SOCRATES : Then in these two events the combination of myself as passive
and it as the active factor will generate different things?
THEAETETUS : Of course.
SOCRATES : Now if I drink wine when I am well, it appears to me pleasant
and sweet?
THEAETETUS : Yes. d
SOCRATES : Going by what we earlier agreed, that is so because the active
and passive factors, moving simultaneously, generate both sweetness and a
perception; on the passive side, the perception makes the tongue percipient,
while on the side of the wine, sweetness moving about it makes it both
be and appear sweet to the healthy tongue.
THEAETETUS : That’s certainly the sense of what we agreed to before.178 Theaetetus
SOCRATES : But when the active factor ﬁnds Socrates ill, then, to begin
with, it is not in strict truth the same man that it gets hold of, is it? Because
here, as we saw, it has come upon an unlike.
THEAETETUS : Yes.
SOCRATES : Then this pair, Socrates ill and the draft of wine, generates, e
presumably, different things again: a perception of bitterness in the region
of the tongue, and bitterness coming to be and moving in the region of
the wine. And then the wine becomes, not bitterness, but bitter; and I
become, not perception, but percipient.
THEAETETUS : Yes, quite.
SOCRATES : And I shall never again become thus percipient of anything
else. A perception of something else is another perception, and makes 160
another and a changed percipient. Nor again, in the case of that which
acts on me, will it ever, in conjunction with something else, generate the
same thing and itself become such as it now is. From something else it
will generate something else, and itself become a changed thing.
THEAETETUS : That is so.
SOCRATES : Nor will I become such for myself or it such for itself.
THEAETETUS : No.
SOCRATES : But I must necessarily become percipient of something when
I become percipient; it is impossible to become percipient, yet percipient b
of nothing. And it again, when it becomes sweet or bitter or anything of
that kind, must become so for somebody, because it is impossible to become
sweet and yet sweet for no one.
THEAETETUS : Quite impossible.
SOCRATES : It remains, then, that I and it, whether we are or whether we
become, are or become for each other. For our being is, by Necessity’s
decree, tied to a partner; yet we are tied neither to any other thing in the
world nor to our respective selves. It remains, then, that we are tied to
each other. Hence, whether you apply the term ‘being’ to a thing or the
term ‘becoming’, you must always use the words ‘for somebody’ or‘of
something’ or‘relatively to something’. You must not speak of anything
as in itself either being or becoming nor let anyone else use such expres- c
sions. That is the meaning of the theory we have been expounding.
THEAETETUS : Yes, that’s certainly true, Socrates.
SOCRATES : Then since that which acts on me is for me, and not for anyone
else, it is I who perceive it too, and nobody else?
THEAETETUS : Undoubtedly.
SOCRATES : Then my perception is true for me —because it is always a
perception of that being which is peculiarly mine; and I am judge, as
Protagoras said, of things that are, that they are, for me; and of things that
are not, that they are not.
THEAETETUS : So it seems.
SOCRATES : How then, if I am thus unerring and never stumble in my d
thought about what is —or what is coming to be —how can I fail to be a
knower of the things of which I am a perceiver?
THEAETETUS : There is no way you could fail.Theaetetus 179
SOCRATES : Then that was a grand idea of yours when you told us that
knowledge is nothing more or less than perception. So we ﬁnd the various
theories have converged to the same thing: that of Homer and Heraclitus
and all their tribe, that all things ﬂow like streams; of Protagoras, wisest
of men, that man is the measure of all things; and of Theaetetus that, e
these things being so, knowledge proves to be perception. What about it,
Theaetetus? Shall we say we have here your ﬁrst-born child, the result of
my midwifery? Or what would you say?
THEAETETUS : Oh, there’s no denying it, Socrates.
SOCRATES : This, then, it appears, is what our efforts have at last brought
forth —whatever it really is. And now that it has been born, we must
perform the rite of running round the hearth with it; we must make it in
good earnest go the round of discussion. For we must take care that we
don’t overlook some defect in this thing that is entering into life; it may
be something not worth bringing up, a wind-egg, a falsehood. What do 161
you say? Is it your opinion that your child ought in any case to be brought
up and not exposed to die? Can you bear to see it found fault with, and
not get into a rage if your ﬁrst-born is stolen away from you?
THEODORUS : Theaetetus will put up with it, Socrates. He is not at all one
to lose his temper. But tell me, in Heaven’s name, in what way is it not
as it should be?
SOCRATES : You are the complete lover of discussion, Theodorus, and it
is too good of you to think that I am a sort of bag of arguments, and
can easily pick one out which will show you that this theory is wrong. b
But you don’t realize what is happening. The arguments never come from
me; they always come from the person I am talking to. All that I know,
such as it is, is how to take an argument from someone else —someone
who iswise —and give it a fair reception. So, now, I propose to try
to get our answer out of Theaetetus, not to make any contribution of
my own.
THEODORUS : That’s a better way of putting it, Socrates; do as you say.
SOCRATES : Well then, Theodorus, do you know what astonishes me about
your friend Protagoras?
THEODORUS :N o —what is it? c
SOCRATES : Well, I was delighted with his general statement of the theory
that a thing is for any individual what it seems to him to be; but I was
astonished at the way he began. I was astonished that he did not state at
the beginning of the Truth that ‘Pig is the measure of all things’ or‘Baboon’
or some yet more out-of-the-way creature with the power of perception.
That would have made a most imposing and disdainful opening. It would
have made it clear to us at once that, while we were standing astounded
at his wisdom as though he were a god, he was in reality no better authority d
than a tadpole —let alone any other man.
Or what are we to say, Theodorus? If whatever the individual judges
by means of perception is true for him; if no man can assess another’s
experience better than he, or can claim authority to examine another man’s
judgment and see if it be right or wrong; if, as we have repeatedly said,180 Theaetetus
only the individual himself can judge of his own world, and what he
judges is always true and correct: how could it ever be, my friend, that
Protagoras was a wise man, so wise as to think himself ﬁt to be the teacher e
of other men and worth large fees; while we, in comparison with him the
ignorant ones, needed to go and sit at his feet —we who are ourselves
each the measure of his own wisdom? Can we avoid the conclusion that
Protagoras was just playing to the crowd when he said this? I say nothing
about my own case and my art of midwifery and how silly we look. So
too, I think, does the whole business of philosophical discussion. To exam-
ine and try to refute each other’s appearances and judgments, when each
person’s are correct —this is surely an extremely tiresome piece of nonsense, 162
if the Truth of Protagoras is true, and not merely an oracle speaking in
jest from the impenetrable sanctuary of the book.
THEODORUS : Protagoras was my friend, Socrates, as you have just re-
marked. I could not consent to have him refuted through my admissions;
and yet I should not be prepared to resist you against my own judgment.
So take on Theaetetus again. He seemed to be following you very sympa-
thetically just now.
SOCRATES : Now, Theodorus, supposing you went to Sparta and were b
visiting the wrestling-schools. Would you think it right to sit and watch
other men exercising naked —some of them not much to look at —and
refuse to strip yourself alongside of them, and take your turn of letting
people see what you look like?
THEODORUS : Why not, if I could persuade them to leave the choice to
me? Similarly I am hoping to persuade you to allow me to be a spectator
and not drag me into the arena now that I am grown stiff; but to take on
someone who is younger and more supple.
SOCRATES : Well, Theodorus, what you like I’ll not dislike, as the saying
goes. So we must again resort to our wise Theaetetus. Come, Theaetetus. c
Think, to begin with, of what we have just been saying, and tell me if you
are not yourself astonished at suddenly ﬁnding that you are the equal in
wisdom of any man or even a god? —Or do you think the Protagorean
measure isn’t meant to be applied to gods as much as to men?
THEAETETUS : I most certainly don’t. And, to answer your question, yes,
I am very much astonished. When we were working out the meaning of d
the principle that a thing is for each man what it seems to him to be, it
appeared to me a very sound one. But now, all in a minute, it is quite the
other way round.
SOCRATES : Yes, because you are young, dear lad; and so you lend a ready
ear to mob-oratory and let it convince you. For Protagoras, or anyone
speaking on his behalf, will answer us like this: ‘My good people, young
and old,’ he will say, ‘you sit here orating; you drag in gods, whose e
existence or nonexistence I exclude from all discussion, written or spoken;14
14. A reference to a notorious declaration by Protagoras (Diog. Laert. 9.51): ‘Concerning
gods I am unable to know whether they exist or do not exist, or what they are like inTheaetetus 181
you keep on saying whatever is likely to be acceptable to the mob, telling
them that it would be a shocking thing if no man were wiser than any
cow in a ﬁeld; but of proof or necessity not a word. You just rely on
plausibility; though if Theodorus or any other geometer were to do that
in his branch of science, it’s a good-for-nothing geometer he would be’.
So you and Theodorus had better consider whether, in matters of such
importance, you are going to accept arguments which are merely persua- 163
sive or plausible.
THEAETETUS : You wouldn’t say we had any business to do that, Socrates;
and neither should we.
SOCRATES : Then, it seems, you and Theodorus say our criticism should
take a different line?
THEAETETUS : Yes, it certainly should.
SOCRATES : Here, then, is another way in which we might consider whether
knowledge and perception are the same or different things —for that is
the question which our argument has held in view throughout, isn’t it?
And it was for its sake that we have unearthed all this extraordinary stuff?
THEAETETUS : Undoubtedly.
SOCRATES : Well, now, are we going to agree that when we perceive things b
by seeing or hearing them, we always at the same time know them? Take,
for example, the case of hearing people speaking a foreign language which
we have not yet learned. Are we going to say that we do not hear the
sound of their voices when they speak? Or that we both hear it and know
what they are saying? Again, supposing we do not know our letters, are
we going to insist that we do not see them when we look at them? Or
shall we maintain that, if we see them, we know them?
THEAETETUS : We shall say, Socrates, that we know just that in them which
we see and hear. We both see and know the shape and the color of the
letters; and with the spoken words we both hear and know the rise and c
fall of the voice. But what schoolmasters and interpreters tell us about
them, we don’t perceive by seeing or hearing, and we don’t know, either.
SOCRATES : Very good indeed, Theaetetus; and it would not be right for
me to stand in the way of your progress by raising objections to what you
say. But look, there is another difﬁculty coming upon us. You must think
now how we are going to fend it off.
THEAETETUS : What kind of difﬁculty?
SOCRATES : I mean something like this. Supposing you were asked, ‘If a d
man has once come to know a certain thing, and continues to preserve
the memory of it, is it possible that, at the moment when he remembers
it, he doesn’t know this thing that he is remembering?’ But I am being
long-winded, I’m afraid. What I am trying to ask is, ‘Can a man who has
learned something not know it when he is remembering it?’
THEAETETUS : How could that happen, Socrates? That would be a most
extraordinary thing.
form; for there are many hindrances to knowledge, the obscurity of the subject and the
brevity of human life’.182 Theaetetus
SOCRATES : Then am I perhaps talking nonsense? But think now. You say
that seeing is perceiving and sight is perception?
THEAETETUS : Yes.
SOCRATES : Then a man who has seen something has come to know that e
which he saw, according to the statement you made just now?
THEAETETUS : Yes.
SOCRATES : But you do say —don’t you? —that there is such a thing as
memory?
THEAETETUS : Yes.
SOCRATES : Memory of nothing? Or of something?
THEAETETUS : Of something, surely.
SOCRATES : That is to say, of things which one has learned, that is, per-
ceived —that kind of ‘something’?
THEAETETUS : Of course.
SOCRATES : And what a man has once seen, he recalls, I take it, from time
to time?
THEAETETUS : He does.
SOCRATES : Even if he shuts his eyes? Or does he forget it if he does this?
THEAETETUS : That would be a strange thing to say, Socrates.
SOCRATES : Yet it is what we must say, if we are to save our previous 164
statement. Otherwise, it’s all up with it.
THEAETETUS : Yes, by Jove, I begin to have my suspicions too; but I don’t
quite see it yet. You explain.
SOCRATES : This is why. According to us, the man who sees has acquired
knowledge of what he sees, as sight, perception and knowledge are agreed
to be the same thing.
THEAETETUS : Yes, certainly.
SOCRATES : But the man who sees and has acquired knowledge of the
thing he saw, if he shuts his eyes remembers but does not see it. Isn’t that so?
THEAETETUS : Yes.
SOCRATES : But to say ‘He doesn’t see’ is to say ‘He doesn’t know’,i f b
‘sees’ is‘knows’?
THEAETETUS : True.
SOCRATES : Then we have this result, that a man who has come to know
something and still remembers it doesn’t know it because he doesn’t see
it? And that’s what we said would be a most extraordinary thing to happen.
THEAETETUS : That’s perfectly true.
SOCRATES : Then apparently we get an impossible result when knowledge
and perception are identiﬁed?
THEAETETUS : It looks like it.
SOCRATES : Then we have got to say that perception is one thing and
knowledge another?
THEAETETUS : Yes, I’m afraid so.
SOCRATES : Then what isknowledge? We shall have to begin again at the c
beginning, it seems. And yet —whatever are we thinking about, Theaetetus?
THEAETETUS : What do you mean?Theaetetus 183
SOCRATES : We appear to be behaving like a base-born ﬁghting-cock,
jumping away off the theory, and crowing before we have the victory
over it.
THEAETETUS : How are we doing that?
SOCRATES : We seem to have been adopting the methods of professional
controversialists: we’ve made an agreement aimed at getting words to
agree consistently; and we feel complacent now that we have defeated the
theory by the use of a method of this kind. We profess to be philosophers,
not champion controversialists; and we don’t realize that we are doing d
just what those clever fellows do.
THEAETETUS : I still don’t quite see what you mean.
SOCRATES : Well, I will try to explain what I have in mind here. We were
enquiring into the possibility that a man should not know something that
he has learned and remembers. And we showed that a man who has seen
something, and then shuts his eyes, remembers but does not see it; and
that showed that he does not know the thing at the very time that he
remembers it. We said that this was impossible. And so the tale of Protag-
oras comes to an untimely end; yours too, your tale about the identity of
knowledge and perception.
THEAETETUS : So it appears. e
SOCRATES : But I don’t think this would have happened, my friend, if the
father of the other tale were alive. He would ﬁnd plenty of means of
defending it. As things are, it is an orphan we are trampling in the mud.
Not even the people Protagoras appointed its guardians are prepared to
come to its rescue; for instance, Theodorus here. In the interests of justice,
it seems that we shall have to come to the rescue ourselves.
THEODORUS : I think you must. It is not I, you know, Socrates, but Callias, 165
the son of Hipponicus,15who is the guardian of Protagoras’ relicts. As it
happened, I very soon inclined away from abstract discussion to geometry.
But I shall be very grateful if you can rescue the orphan.
SOCRATES : Good, Theodorus. Now will you give your mind to this rescue
work of mine —what little I can do? Because one might be driven into
making even more alarming admissions than we have just made, if one
paid as little attention to the words in which we express our assertions
and denials as we are for the most part accustomed to doing. Shall I tell
you how this might happen? Or shall I tell Theaetetus?
THEODORUS : Tell us both, Socrates; but the younger had better answer.
It will not be so undigniﬁed for him to get tripped up. b
SOCRATES : Well, then, here is the most alarming poser of all. It goes
something like this, I think: ‘Is it possible for a man who knows something
not to know this thing which he knows?’
15. A wealthy Athenian famous for his patronage of the sophists: ‘a man who has spent
more money on sophists than everyone else put together ’(Apology 20a). The discussion
of Plato’s Protagoras is set in his house, where Protagoras and other visiting sophists
are staying.184 Theaetetus
THEODORUS : What are we going to answer now, Theaetetus?
THEAETETUS : That it is impossible, I should think.
SOCRATES : But it is not, if you are going to premise that seeing is knowing.
For what are you going to do when some intrepid fellow has you ‘trapped
in the well-shaft’, as they say, with a question that leaves you no way out:
clapping his hand over one of your eyes, he asks you whether you see his c
cloak with the eye that is covered —how will you cope with that?
THEAETETUS : I shall say that I don’t see it with this one, but I do with
the other.
SOCRATES : So you both see and do not see the same thing at the same time?
THEAETETUS : Well, yes, in that sort of way I do.
SOCRATES :‘That’s not the question I’m setting you,’ he will say, ‘I was
not asking you in what way it happened. I was asking you “Does it happen
that you don’t know what you know?” You now appear to be seeing what
you don’t see; and you have actually admitted that seeing is knowing,
and not to see is not to know. I leave you to draw your conclusion.’
THEAETETUS : Well, I draw a conclusion that contradicts my original sup- d
positions.
SOCRATES : And that is the kind of thing that might have happened to
you more than once, you wonderful fellow. It might have happened if
someone had gone on asking you whether it was possible to know some-
times clearly and sometimes dimly; or to know near at hand and not from
a distance; or to know the same thing both intensely and slightly. And
there are a million other questions with which one of the mercenary skir-
mishers of debate might ambush you, once you had proposed that knowl-
edge and perception are the same thing. He would lay into hearing and
smelling and other perceptions of that kind; and would keep on refuting
you and not let you go till you had been struck with wonder at his e
wisdom —that ‘answer to many prayers’—and had got yourself thoroughly
tied up by him. Then, when he had you tamed and bound, he would set
you free for a ransom —whatever price seemed appropriate to the two
of you.
But perhaps you’ll ask, what argument would Protagoras himself bring
to the help of his offspring. Shall we try to state it?
THEAETETUS : Yes, surely.
SOCRATES : Well, he will say all the things that we are saying in our
attempt to defend him; and then, I imagine, he will come to grips with 166
us, and in no respectful spirit either. I imagine him saying: ‘This good
Socrates here —what he did was to frighten a small boy by asking him if
it were possible that the same man should at once remember and not know
the same thing; and when the boy in his fright answered “No,” because
he couldn’t see what was coming, then, according to Socrates, the laugh
was against mein the argument. You are too easy-going, Socrates. The
true position is this. When you are examining any doctrine of mine by the
method of question and answer, if the person being questioned answers
as I myself would answer, and gets caught, then it is I who am refuted;Theaetetus 185
but if his answers are other than I should give, then it is he who is put in b
the wrong.
‘Now, to begin with, do you expect someone to grant you that a man
has a present memory of things he experienced in the past, this being an
experience rather like the original one, unless he is still experiencing them?
That is very far from being true. Again, do you suppose he will hesitate
to admit that it is possible for the same man to know and not know the
same thing? Or—if he has misgivings about this—do you expect him to
concede to you that the man, who is in process of becoming unlike, is the
same as he was before the process began? Do you expect him even to
speak of “the man” rather than of “the men,” indeed of an inﬁnite number
of these men coming to be in succession, assuming this process of becoming
unlike? Not if we really must take every precaution against each other’s c
verbal traps. Show a little more spirit, my good man,’ he will say, ‘and
attack my actual statement itself, and refute it, if you can, by showing that
each man’s perceptions are not his own private events; or that, if they are
his own private events, it does not follow that the thing which appears
“becomes” or, if we may speak of being, “is” only for the man to whom
it appears. You keep talking about pigs and baboons; you show the mental-
ity of a pig yourself, in the way you deal with my writings, and you
persuade your audience to follow your example. That is not the way d
to behave.
‘I take my stand on the truth being as I have written it. Each one of us
is the measure both of what is and of what is not; but there are countless
differences between men for just this very reason, that different things
both are and appear to be to different subjects. I certainly do not deny the
existence of both wisdom and wise men: far from it. But the man whom
I call wise is the man who can change the appearances—the man who in
any case where bad things both appear and are for one of us, works a
change and makes good things appear and be for him.
‘And I must beg you, this time, not to conﬁne your attack to the letter e
of my doctrine. I am now going to make its meaning clearer to you. For
instance, I would remind you of what we were saying before, namely,
that to the sick man the things he eats both appear and are bitter, while
to the healthy man they both appear and are the opposite. Now what we
have to do is not to make one of these two wiser than the other—that is 167
not even a possibility—nor is it our business to make accusations, calling
the sick man ignorant for judging as he does, and the healthy man wise,
because he judges differently. What we have to do is to make a change
from the one to the other, because the other state is better. In education,
too, what we have to do is to change a worse state into a better state; only
whereas the doctor brings about the change by the use of drugs, the
professional teacher16does it by the use of words. What never happens is
that a man who judges what is false is made to judge what is true. For it
16. Literally, ‘the sophist’.186 Theaetetus
is impossible to judge what is not, or to judge anything other than what one
is immediately experiencing; and what one is immediately experiencing is b
always true. This, in my opinion, is what really happens: when a man’s
soul is in a pernicious state, he judges things akin to it, but giving him a
sound state of the soul causes him to think different things, things that
are good. In the latter event, the things which appear to him are what
some people, who are still at a primitive stage, call “true”; my position,
however, is that the one kind are better than the others, but in no way truer.
‘Nor, my dear Socrates, should I dream of suggesting that we might
look for wisdom among frogs. I look for wisdom, as regards animal bodies,
in doctors; as regards plant-life, in gardeners —for I am quite prepared to
maintain that gardeners too, when they ﬁnd a plant sickly, proceed by c
causing it to have good and healthy, that is, “true” perceptions, instead
of bad ones. Similarly, the wise and efﬁcient politician is the man who
makes wholesome things seem just to a city instead of pernicious ones.
Whatever in any city is regarded as just and admirable isjust and admirable,
in that city and for so long as that convention maintains itself; but the
wise man replaces each pernicious convention by a wholesome one, making
this both be and seem just. Similarly the professional teacher who is able
to educate his pupils on these lines is a wise man, and is worth his large d
fees to them.
‘In this way we are enabled to hold both that some men are wiser than
others, and also that no man judges what is false. And you, too, whether
you like it or not, must put up with being a “measure.” For this is the line
we must take if we are to save the theory.
‘If you feel prepared to go back to the beginning, and make a case against
this theory, let us hear your objections set out in a connected argument.
Or, if you prefer the method of question and answer, do it that way; there
is no reason to try to evade that method either, indeed an intelligent person
might well prefer it to any other. Only I beg that you will observe this
condition: do not be unjust in your questions. It is the height of unreason- e
ableness that a person who professes to care for moral goodness should
be consistently unjust in discussion. I mean by injustice, in this connection,
the behavior of a man who does not take care to keep controversy distinct
from discussion; a man who forgets that in controversy he may play about
and trip up his opponent as often as he can, but that in discussion he must
be serious, he must keep on helping his opponent to his feet again, and
point out to him only those of his slips which are due to himself or to the 168
intellectual society which he has previously frequented. If you observe
this distinction, those who associate with you will blame themselves for
their confusion and their difﬁculties, not you. They will seek your company,
and think of you as their friend; but they will loathe themselves, and seek
refuge from themselves in philosophy, in the hope that they may thereby
become different people and be rid forever of the men that they once were.
But if you follow the common practice and do the opposite, you willTheaetetus 187
get the opposite results. Instead of philosophers, you will make your b
companions grow up to be the enemies of philosophy.
‘So, if you take my advice, as I said before, you will sit down with us
without ill will or hostility, in a kindly spirit. You will genuinely try to
ﬁnd out what our meaning is when we maintain (a) that all things are in
motion and (b) that for each person and each city, things are what they seem
to them to be. And upon this basis you will inquire whether knowledge and
perception are the same thing or different things. But you will not proceed
as you did just now. You will not base your argument upon the use and
wont of language; you will not follow the practice of most men, who drag c
words this way and that at their pleasure, so making every imaginable
difﬁculty for one another.’
Well, Theodorus, here is my contribution to the rescue of your friend —
the best I can do, with my resources, and little enough that is. If he were
alive himself, he would have come to the rescue of his offspring in a
grander style.
THEODORUS : That must be a joke, Socrates. It was a very spirited rescue.
SOCRATES : You are kind, my friend. Tell me now, did you notice that
Protagoras was complaining of us, in the speech that we have just heard, d
for addressing our arguments to a small boy and making the child’s ner-
vousness a weapon against his ideas? And how he disparaged our method
of arguments as merely an amusing game, and how solemnly he upheld
his‘measure of all things’ and commanded us to be serious when we dealt
with his theory?
THEODORUS : Yes, of course I noticed that, Socrates.
SOCRATES : Then do you think we should obey his commands?
THEODORUS : Most certainly I do.
SOCRATES : Look at the company then. They are all children but you. So
if we are to obey Protagoras, it is you and I who have got to be serious e
about his theory. It is you and I who must question and answer one
another. Then he will not have thisagainst us, at any rate, that we turned
the criticism of his philosophy into sport with boys.
THEODORUS : Well, isn’t our Theaetetus better able to follow the investiga-
tion of a theory than many an old fellow with a long beard?
SOCRATES : But not better than you, Theodorus. Do not go on imagining
that it is my business to be straining every nerve to defend your dead 169
friend while you do nothing. Come now, my very good Theodorus, come
a little way with me. Come with me at any rate until we see whether in
questions of geometrical proofs it is really you who should be the measure
or whether all men are as sufﬁcient to themselves as you are in astronomy
and all the other sciences in which you have made your name.
THEODORUS : Socrates, it is not easy for a man who has sat down beside
you to refuse to talk. That was all nonsense just now when I was pretending
that you were going to allow me to keep my coat on, and not use compul-
sion like the Spartans. So far from that, you seem to me to have leanings188 Theaetetus
towards the methods of Sciron.17The Spartans tell one either to strip or b
to go away; but you seem rather to be playing the part of Antaeus.18You
don’t let any comer go till you have stripped him and made him wrestle
with you in an argument.
SOCRATES : That, Theodorus, is an excellent simile to describe what is the
matter with me. But I am more of a ﬁend for exercise than Sciron and
Antaeus. I have met with many and many a Heracles and Theseus in my
time, mighty men of words; and they have well battered me. But for all
that I don’t retire from the ﬁeld, so terrible a lust has come upon me for c
these exercises. You must not grudge me this, either; try a fall with me
and we shall both be the better.
THEODORUS : All right. I resign myself; take me with you where you like.
In any case, I see, I have got to put up with the fate you spin for me, and
submit to your inquisition. But not further than the limits you have laid
down; beyond that I shall not be able to offer myself.
SOCRATES : It will do if you will go with me so far. Now there is one kind
of mistake I want you to be specially on your guard against, namely, that
we do not unconsciously slip into some childish form of argument. We d
don’t want to get into disgrace for this again.
THEODORUS : I will do my best, I promise you.
SOCRATES : The ﬁrst thing, then, is to tackle the same point that we were
dealing with before. We were making a complaint. Now let us see whether
we were right or wrong in holding it to be a defect in this theory that it
made every man self-sufﬁcient in wisdom; and whether we were right or
wrong when we made Protagoras concede that some men are superior
to others in questions of better and worse, these being ‘the wise’.D o
you agree?
THEODORUS : Yes.
SOCRATES : It would be a different matter if Protagoras were here in person
and agreed with us, instead of our having made this concession on his e
behalf in our attempt to help him. In that case, there would be no need
to take this question up again and make sure about it. In the circumstances,
however, it might be decided that we had no authority on his behalf, and
so it is desirable that we should come to a clearer agreement on this point;
for it makes no small difference whether this is so or not.
THEODORUS : True.
SOCRATES : Then don’t let us obtain this concession through anybody else. 170
Let us take the shortest way, an appeal to his own statement.
THEODORUS : How?
17. A legendary highwayman who attacked travellers on the coast between Megara and
Corinth. His most famous ‘method’ was to compel them to wash his feet, and kick them
over the cliff into the sea while they were so doing.
18. Antaeus was said to have lived in a cave and compelled all passers-by to wrestle
with him, with results invariably fatal to them.Theaetetus 189
SOCRATES : In this way. He says, does he not, that things are for every
man what they seem to him to be?
THEODORUS : Yes, that is what he says.
SOCRATES : Well, then, Protagoras, we too are expressing the judgments
of a man —I might say, of all men —when we say that there is no one in
the world who doesn’t believe that in some matters he is wiser than other
men; while in other matters, they are wiser than he. In emergencies —if at
no other time —you see this belief. When they are in distress, on the
battleﬁeld, or in sickness or in a storm at sea, all men turn to their leaders
in each sphere as to gods and look to them for salvation because they are b
superior in precisely this one thing —knowledge. And wherever human
life and work goes on, you ﬁnd everywhere men seeking teachers and
masters, for themselves and for other living creatures and for the direction
of all human works. You ﬁnd also men who believe that they are able to
teach and to take the lead. In all these cases, what else can we say but
that men do believe in the existence of both wisdom and ignorance
among themselves?
THEODORUS : There can be no other conclusion.
SOCRATES : And they believe that wisdom is true thinking? While igno-
rance is a matter of false judgment?
THEODORUS : Yes, of course. c
SOCRATES : What then, Protagoras, are we to make of your argument?
Are we to say that all men, on every occasion, judge what is true? Or that
they judge sometimes truly and sometimes falsely? Whichever we say, it
comes to the same thing, namely, that men do not always judge what is
true; that human judgments are both true and false. For think, Theodorus.
Would you, would anyone of the school of Protagoras be prepared to
contend that no one ever thinks his neighbor is ignorant or judging falsely?
THEODORUS : No, that’s not a thing one could believe, Socrates.
SOCRATES : And yet it is to this that our theory has been driven —this d
theory that man is the measure of all things.
THEODORUS : How is that?
SOCRATES : Well, suppose you come to a decision in your own mind and
then express a judgment about something to me. Let us assume with
Protagoras that your judgment is true for you. But isn’t it possible that the
rest of us may criticize your verdict? Do we always agree that your judg-
ment is true? Or does there rise up against you, every time, a vast army
of persons who think the opposite, who hold that your decisions and your
thoughts are false?
THEODORUS : Heaven knows they do, Socrates, in their ‘thousands and e
tens of thousands’, as Homer says,19and give me all the trouble that is
humanly possible.
19.Odyssey xvi.121.190 Theaetetus
SOCRATES : Then do you want us to say that you are then judging what
is true for yourself, but false for the tens of thousands?
THEODORUS : It looks as if that is what we must say, according to the
theory, at any rate.
SOCRATES : And what of Protagoras himself? Must he not say this, that
supposing he himself did not believe that man is the measure, any more
than the majority of people (who indeed do not believe it), then this Truth
which he wrote is true for no one? On the other hand, suppose he believed 171
it himself, but the majority of men do not agree with him; then you see —
to begin with —the more those to whom it does not seem to be the truth
outnumber those to whom it does, so much the more it isn’t than it is?
THEODORUS : That must be so, if it is going to be or not be according to
the individual judgment.
SOCRATES : Secondly, it has this most exquisite feature: Protagoras admits,
I presume, that the contrary opinion about his own opinion (namely, that
it is false) must be true, seeing he agrees that all men judge what is.
THEODORUS : Undoubtedly.
SOCRATES : And in conceding the truth of the opinion of those who think b
him wrong, he is really admitting the falsity of his own opinion?
THEODORUS : Yes, inevitably.
SOCRATES : But for their part the others do not admit that they are wrong?
THEODORUS : No.
SOCRATES : But Protagoras again admits thisjudgment to be true, accord-
ing to his written doctrine?
THEODORUS : So it appears.
SOCRATES : It will be disputed, then, by everyone, beginning with Protag-
oras —or rather, it will be admitted by him, when he grants to the person
who contradicts him that he judges truly —when he does that, even Protag- c
oras himself will be granting that neither a dog nor the ‘man in the street’
is the measure of anything at all which he has not learned. Isn’t that so?
THEODORUS :I ti ss o .
SOCRATES : Then since it is disputed by everyone, the Truth of Protagoras
is not true for anyone at all, not even for himself?
THEODORUS : Socrates, we are running my friend too hard.
SOCRATES : But it is not at all clear, my dear Theodorus, that we are
running off the right track. Hence it is likely that Protagoras, being older
than we are, really is wiser as well; and if he were to stick up his head d
from below as far as the neck just here where we are, he would in all
likelihood convict me twenty times over of talking nonsense, and show
you up too for agreeing with me, before he ducked down to rush off again.
But we have got to take ourselves as we are, I suppose, and go on saying
the things which seem to us to be. At the moment, then, mustn’tw e
maintain that any man would admit at least this, that some men are wiser
than their fellows and others more ignorant?
THEODORUS : So it seems to me, at any rate.Theaetetus 191
SOCRATES : We may also suggest that the theory would stand ﬁrm most
successfully in the position which we sketched out for it in our attempt e
to bring help to Protagoras. I mean the position that most things are for
the individual what they seem to him to be; for instance, warm, dry, sweet
and all this type of thing. But if the theory is going to admit that there is
any sphere in which one man is superior to another, it might perhaps be
prepared to grant it in questions of what is good or bad for one’s health.
Here it might well be admitted that it is not true that every creature—
woman or child or even animal—is competent to recognize what is good
for it and to heal its own sickness; that here, if anywhere, one person is
better than another. Do you agree?
THEODORUS : Yes, that seems so to me.
SOCRATES : Then consider political questions. Some of these are questions 172
of what may or may not ﬁttingly be done, of just and unjust, of pious and
impious; and here the theory may be prepared to maintain that whatever
view a city takes on these matters and establishes as its law or convention,
is truth and fact for that city. In such matters neither any individual nor
any city can claim superior wisdom. But when it is a question of laying
down what is to the interest of the state and what is not, the matter is
different. The theory will again admit that here, if anywhere, one counsellor
is better than another; here the decision of one city may be more in confor-
mity with the truth than that of another. It would certainly not have the b
hardihood to afﬁrm that when a city decides that a certain thing is to its
own interest, that thing will undoubtedly turn out to be to its interest. It
is in those other questions I am talking about—just and unjust, pious and
impious—that men are ready to insist that no one of these things has by
nature any being of its own; in respect of these, they say, what seems to
people collectively to be so is true, at the time when it seems that way
and for just as long as it so seems. And even those who are not prepared
to go all the way with Protagoras take some such view of wisdom. But I
see, Theodorus, that we are becoming involved in a greater discussion c
emerging from the lesser one.
THEODORUS : Well, we have plenty of time, haven’t we, Socrates?
SOCRATES : We appear to . . . That remark of yours, my friend, reminds
me of an idea that has often occurred to me before—how natural it is that
men who have spent a great part of their lives in philosophical studies make
such fools of themselves when they appear as speakers in the law courts.
THEODORUS : How do you mean now?
SOCRATES : Well, look at the man who has been knocking about in law
courts and such places ever since he was a boy; and compare him with
the man brought up in philosophy, in the life of a student. It is surely like d
comparing the upbringing of a slave with that of a free man.
THEODORUS : How is that, now?
SOCRATES : Because the one man always has what you mentioned just
now—plenty of time. When he talks, he talks in peace and quiet, and his192 Theaetetus
time is his own. It is so with us now: here we are beginning on our third
new discussion; and he can do the same, if he is like us, and prefers the
newcomer to the question in hand. It does not matter to such men whether
they talk for a day or a year, if only they may hit upon that which is. But
the other —the man of the law courts —is always in a hurry when he is e
talking; he has to speak with one eye on the clock. Besides, he can’t make
his speeches on any subject he likes; he has his adversary standing over
him, armed with compulsory powers and with the sworn statement, which
is read out point by point as he proceeds, and must be kept to by the
speaker. The talk is always about a fellow-slave, and is addressed to a
master, who sits there holding some suit or other in his hand. And the
struggle is never a matter of indifference; it always directly concerns the
speaker, and sometimes life itself is at stake.
Such conditions make him keen and highly strung, skilled in ﬂattering 173
the master and working his way into favor; but cause his soul to be small
and warped. His early servitude prevents him from making a free, straight
growth; it forces him into doing crooked things by imposing dangers and
alarms upon a soul that is still tender. He cannot meet these by just and
honest practice, and so resorts to lies and to the policy of repaying one
wrong with another; thus he is constantly being bent and distorted, and b
in the end grows up to manhood with a mind that has no health in it,
having now become —in his own eyes —a man of ability and wisdom.
There is your practical man, Theodorus. What about our own set? Would
you like us to have a review of them, or shall we let them be, and return
to the argument? We don’t want to abuse this freedom to change our
subject of which we were speaking just now.
THEODORUS : No, no, Socrates. Let us review the philosophers. What you c
said just now was quite right; we who move in such circles are not the
servants but the masters of our discussions. Our arguments are our own,
like slaves; each one must wait about for us, to be ﬁnished whenever we
think ﬁt. We have no jury, and no audience (as the dramatic poets have),
sitting in control over us, ready to criticize and give orders.
SOCRATES : Very well, then; we must review them, it seems, since you
have made up your mind. But let us conﬁne ourselves to the leaders;
why bother about the second-rate specimens? To begin with, then, the
philosopher grows up without knowing the way to the market-place, or d
the whereabouts of the law courts or the council chambers or any other
place of public assembly. Laws and decrees, published orally or in writing,
are things he never sees or hears. The scrambling of political cliques for
ofﬁce; social functions, dinners, parties with ﬂute-girls —such doings never
enter his head even in a dream. So with questions of birth —he has no
more idea whether a fellow citizen is high-born or humble, or whether he
has inherited some taint from his forebears, male or female, than he has
of the number of pints in the sea, as they say. And in all these matters, e
he knows not even that he knows not; for he does not hold himself aloof
from them in order to get a reputation, but because it is in reality only hisTheaetetus 193
body that lives and sleeps in the city. His mind, having come to the
conclusion that all these things are of little or no account, spurns them
and pursues its winge ´d way, as Pindar says,20throughout the universe,
‘in the deeps beneath the earth’ and geometrizing its surfaces, ‘in the
heights above the heaven’, astronomizing, and tracking down by every
path the entire nature of each whole among the things that are, never 174
condescending to what lies near at hand.
THEODORUS : What do you mean by that, Socrates?
SOCRATES : Well, here’s an instance: they say Thales21was studying the
stars, Theodorus, and gazing aloft, when he fell into a well; and a witty
and amusing Thracian servant-girl made fun of him because, she said, he
was wild to know about what was up in the sky but failed to see what
was in front of him and under his feet. The same joke applies to all who
spend their lives in philosophy. It really is true that the philosopher fails b
to see his next-door neighbor; he not only doesn’t notice what he is doing;
he scarcely knows whether he is a man or some other kind of creature.
The question he asks is, What is Man? What actions and passions properly
belong to human nature and distinguish it from all other beings? This is
what he wants to know and concerns himself to investigate. You see what
I mean, Theodorus, don’t you?
THEODORUS : Yes, and what you say is true.
SOCRATES : This accounts, my friend, for the behavior of such a man when
he comes into contact with his fellows, either privately with individuals c
or in public life, as I was saying at the beginning. Whenever he is obliged,
in a law court or elsewhere, to discuss the things that lie at his feet and
before his eyes, he causes entertainment not only to Thracian servant-girls
but to all the common herd, by tumbling into wells and every sort of
difﬁculty through his lack of experience. His clumsiness is awful and gets
him a reputation for fatuousness. On occasions when personal scandal is
the topic of conversation, he never has anything at all of his own to
contribute; he knows nothing to the detriment of anyone, never having
paid any attention to this subject—a lack of resource which makes him d
look very comic. And again, when compliments are in order, and self-
laudation, his evident amusement—which is by no means a pose but
perfectly genuine—is regarded as idiotic. When he hears the praises of a
despot or a king being sung, it sounds to his ears as if some stock-breeder
were being congratulated—some keeper of pigs or sheep, or cows that are
giving him plenty of milk; only he thinks that the rulers have a more
difﬁcult and treacherous animal to rear and milk, and that such a man,
having no spare time, is bound to become quite as coarse and uncultivated e
as the stock-farmer; for the castle of the one is as much a prison as the
20. This quotation from a lost poem of Pindar’s is listed as his frag. 292 (Snell).
21. The ﬁrst founder of Greek natural philosophy (sixth century B.C.), about whom we
have anecdotes but little solid information.194 Theaetetus
mountain fold of the other. When he hears talk of land —that so-and-so
has a property of ten thousand acres or more, and what a vast property
that is, it sounds to him like a tiny plot, used as he is to envisage the
whole earth. When his companions become lyric on the subject of great
families, and exclaim at the noble blood of one who can point to seven
wealthy ancestors, he thinks that such praise comes of a dim and limited
vision, an inability, through lack of education, to take a steady view of 175
the whole, and to calculate that every single man has countless hosts of
ancestors, near and remote, among whom are to be found, in every instance,
rich men and beggars, kings and slaves, Greeks and foreigners, by the
thousand. When men pride themselves upon a pedigree of twenty- ﬁve
ancestors, and trace their descent back to Heracles the son of Amphitryon,
they seem to him to be taking a curious interest in tri ﬂes. As for the twenty- b
ﬁfth ancestor of Amphitryon, what hemay have been is merely a matter
of luck, and similarly with the ﬁftieth before him again. How ridiculous,
he thinks, not to be able to work that out, and get rid of the gaping vanity
of a silly mind.
On all these occasions, you see, the philosopher is the object of general
derision, partly for what men take to be his superior manner, and partly
for his constant ignorance and lack of resource in dealing with the obvious.
THEODORUS : What you say exactly describes what does happen, Socrates.
SOCRATES : But consider what happens, my friend, when he in his turn
draws someone to a higher level, and induces him to abandon questions
of‘My injustice towards you, or yours towards me’ for an examination of c
justice and injustice themselves —what they are, and how they differ from
everything else and from each other; or again, when he gets him to leave
such questions as ‘Whether a king who possesses much gold is happy? ’22
for an inquiry into kingship, and into human happiness and misery in
general —what these two things are, and what, for a human being, is the
proper method by which the one can be obtained and the other avoided.
When it is an account of matters like all these that is demanded of our d
friend with the small, sharp, legal mind, the situation is reversed; his head
swims as, suspended at such a height, he gazes down from his place among
the clouds; disconcerted by the unusual experience, he knows not what
to do next, and can only stammer when he speaks. And that causes great
entertainment, not to Thracian servant-girls or any other uneducated per-
sons —they do not see what is going on —but to all men who have not
been brought up like slaves.
These are the two types, Theodorus. There is the one who has been e
brought up in true freedom and leisure, the man you call a philosopher;
a man to whom it is no disgrace to appear simple and good-for-nothing
when he is confronted with menial tasks, when, for instance, he doesn ’t
know how to make a bed, or how to sweeten a sauce or a ﬂattering speech.
Then you have the other, the man who is keen and smart at doing all
22. Reading, with Madvig, tau¨chrusion.Theaetetus 195
these jobs, but does not know how to strike up a song in his turn like a
free man, or how to tune the strings of common speech to the ﬁtting praise 176
of the life of gods and of the happy among men.
THEODORUS : Socrates, if your words convinced everyone as they do me,
there would be more peace and less evil on earth.
SOCRATES : But it is not possible, Theodorus, that evil should be de-
stroyed —for there must always be something opposed to the good; nor
is it possible that it should have its seat in heaven. But it must inevitably
haunt human life, and prowl about this earth. That is why a man should
make all haste to escape from earth to heaven; and escape means becoming b
as like God as possible; and a man becomes like God when he becomes
just and pious, with understanding. But it is not at all an easy matter, my
good friend, to persuade men that it is not for the reasons commonly
alleged that one should try to escape from wickedness and pursue virtue.
It is not in order to avoid a bad reputation and obtain a good one that
virtue should be practiced and not vice; that, it seems to me, is only what c
men call ‘old wives’ talk’.
Let us try to put the truth in this way. In God there is no sort of wrong
whatsoever; he is supremely just, and the thing most like him is the man
who has become as just as it lies in human nature to be. And it is here
that we see whether a man is truly able, or truly a weakling and a nonentity;
for it is the realization of this that is genuine wisdom and goodness, while
the failure to realize it is manifest folly and wickedness. Everything else
that passes for ability and wisdom has a sort of commonness —in those
who wield political power a poor cheap show, in the manual workers a
matter of mechanical routine. If, therefore, one meets a man who practices d
injustice and is blasphemous in his talk or in his life, the best thing for
him by far is that one should never grant that there is any sort of ability
about his unscrupulousness; such men are ready enough to glory in the
reproach, and think that it means not that they are mere rubbish, cumbering
the ground to no purpose, but that they have the kind of qualities that
are necessary for survival in the community. We must therefore tell them
the truth —that their very ignorance of their true state ﬁxes them the more
ﬁrmly therein. For they do not know what is the penalty of injustice, which
is the last thing of which a man should be ignorant. It is not what they
suppose —scourging and death —things which they may entirely evade in
spite of their wrongdoing. It is a penalty from which there is no escape. e
THEODORUS : And what is that?
SOCRATES : My friend, there are two patterns set up in reality. One is
divine and supremely happy; the other has nothing of God in it, and is
the pattern of the deepest unhappiness. This truth the evildoer does not
see; blinded by folly and utter lack of understanding, he fails to perceive 177
that the effect of his unjust practices is to make him grow more and more
like the one, and less and less like the other. For this he pays the penalty
of living the life that corresponds to the pattern he is coming to resemble.
And if we tell him that, unless he is delivered from this ‘ability’ of his,196 Theaetetus
when he dies the place that is pure of all evil will not receive him; that
he will forever go on living in this world a life after his own likeness —a
bad man tied to bad company: he will but think, ‘This is the way fools
talk to a clever rascal like me.’
THEODORUS : Oh, yes, Socrates, sure enough.
SOCRATES : I know it, my friend. But there is one accident to which the b
unjust man is liable. When it comes to giving and taking an account in a
private discussion of the things he disparages; when he is willing to stand
his ground like a man for long enough, instead of running away like a
coward, then, my friend, an odd thing happens. In the end the things he
says do not satisfy even himself; that famous eloquence of his somehow
dries up, and he is left looking nothing more than a child.
But we had better leave it there; all this is really a digression; and if we c
go on, a ﬂood of new subjects will pour in and overwhelm our original
argument. So, if you don’t mind, we will go back to what we were say-
ing before.
THEODORUS : As a matter of fact, Socrates, Ilike listening to this kind of
talk; it is easier for a man of my years to follow. Still, if you like, let us
go back to the argument.
SOCRATES : Well, then, we were at somewhere about this point in the
argument, weren’t we? We were speaking of the people who assert a being
that is in motion, and who hold that for every individual things always
are whatever they seem to him to be; and we said that they were prepared
to stand upon their principle in almost every case —not least in questions
of what is just and right. Here they are perfectly ready to maintain that
whatever any community decides to be just and right, and establishes as d
such, actually is what is just and right for that community and for as long
as it remains so established. On the other hand, when it is a question of
what things are good, we no longer ﬁnd anyone so heroic that he will
venture to contend that whatever a community thinks useful, and estab-
lishes, really is useful, so long as it is the established order —unless, of
course, he means that it is called ‘useful’; but that would be making a game
of our argument, wouldn’t it?
THEODORUS : It would indeed.
SOCRATES : Let us suppose, then, that he is not talking about the name e
‘useful’ but has in view the thing to which it is applied.
THEODORUS : Agreed.
SOCRATES : It is surely this that a government aims at when it legislates,
whatever name it calls it. A community always makes such laws as are
most useful to it —so far as the limits of its judgment and capacity permit. —
Or do you think legislation may have some other object in view?
THEODORUS : Oh no, not at all. 178
SOCRATES : And does a community always achieve this object? Or are
there always a number of failures?
THEODORUS : It seems to me that there are failures.Theaetetus 197
SOCRATES : Now we might put this matter in a rather different way
and be still more likely to get people generally to agree with our
conclusions. I mean, one might put a question about the whole class
of things to which ‘what is useful’ belongs. These things are concerned,
I take it, with future time; thus when we legislate, we make laws that
are going to be useful in the time to come. This kind of thing we may
properly call ‘future’.
THEODORUS : Yes, certainly. b
SOCRATES : Come then, let’s put a question to Protagoras (or to anyone
who professes the same views): ‘Now, Protagoras, “Man is the measure
of all things” as you people say —of white and heavy and light and all
that kind of thing without exception. He has the criterion of these things
within himself; so when he thinks that they are as he experiences them,
he thinks what is true and what really is for him.’ Isn’t that so?
THEODORUS :I ti s .
SOCRATES :‘Then, Protagoras,’ we shall say, ‘what about things that are
going to be in the future? Has a man the criterion of these within himself? c
When he thinks certain things will be, do they actually happen, for him,
as he thought they would? Take heat, for example. Suppose the ordinary
man thinks he is going to take a fever, and that his temperature will go
up to fever point; while another man, this time a doctor, thinks the opposite.
Do we hold that the future will conﬁrm either the one judgment or the
other? Or are we to say that it will conﬁrm both; that is, that for the doctor
the man will not have a temperature or be suffering from fever, while for
himself he will?’
THEODORUS : That would be absurd.
SOCRATES : But, when there is a question of the sweetness and dryness
of the next vintage, I presume it would always be the grower ’s judgment d
that would carry authority, rather than that of a musician?
THEODORUS : Of course.
SOCRATES : Nor again, in any question of what will be in tune or out of
tune, would the judgment of a teacher of gymnastic be superior to that of
a musician —even about what is going to seem to be in tune to the gymnastic
master himself?
THEODORUS : No, never.
SOCRATES : Or suppose a dinner is being prepared. Even the guest who
is going to eat it, if he has no knowledge of cooking, will not be able to
pronounce so authoritative a verdict as the professional cook on how nice
it is going to be. I say ‘going to be’, because we had better not at this stage e
press our point as regards what is now pleasant to any individual, or what
has been in the past. Our question for the moment is, whether the individual
himself is the best judge, for himself, of what is going to seem and be for
him in the future. ‘Or,’ we will ask, ‘would not you, Protagoras, predict
better than any layman about the persuasive effect that speeches in a law
court will have upon any one of us?’198 Theaetetus
THEODORUS : And in fact, Socrates, this at any rate is a point on which
Protagoras used to make strong claims to superiority over other people.
SOCRATES : Of course he did, my dear good fellow. No one would have
paid large fees for the privilege of talking with him if he had not been in 179
the habit of persuading his pupils that he was a better judge than any
fortune-teller—or anyone else—about what was going to be and seem to
be in the future.23
THEODORUS : That’s true enough.
SOCRATES : Legislation also and ‘what is useful’ is concerned with the
future; and it would be generally admitted to be inevitable that a city
when it legislates often fails to achieve what is the most useful.
THEODORUS : Yes, surely.
SOCRATES : Then we shall be giving your master fair measure if we tell
him that he has now got to admit that one man is wiser than another, and b
that it is such a man who is ‘the measure’; but that I, the man with no
special knowledge, have not by any means got to be a measure—a part
which the recent speech in his defense was trying to force upon me, whether
I liked it or not.
THEODORUS : Now that, Socrates, seems to me to be the chief point on
which the theory is convicted of error—though it stands convicted also
when it makes other men’s judgments carry authority and these turn out
to involve thinking that Protagoras’ statements are completely untrue.
SOCRATES : There is more than one point besides these, Theodorus, on c
which a conviction might be secured—at least so far as it is a matter of
proving that not every man’s judgment is true. But so long as we keep
within the limits of that immediate present experience of the individual
which gives rise to perceptions and to perceptual judgments, it is more
difﬁcult to convict these latter of being untrue—but perhaps I’m talking
nonsense. Perhaps it is not possible to convict them at all; perhaps those
who profess that they are perfectly evident and are always knowledge
may be saying what really is. And it may be that our Theaetetus was not
far from the mark with his proposition that knowledge and perception d
are the same thing. We shall have to come to closer grips with the theory,
as the speech on behalf of Protagoras required us to do. We shall have to
consider and test this moving Being, and ﬁnd whether it rings true or
sounds as if it had some ﬂaw in it. There is no small ﬁght going on about
it, anyway—and no shortage of ﬁghting men.
THEODORUS : No, indeed; but in Ionia it seems to be even growing, and
assuming vast dimensions. On the side of this theory, the Heraclitean party
is conducting a most vigorous campaign.
23. An alternative text (accepting the conjecture of de¯forme¯at 179a1 and retaining the
mss’ hauto ¯iat a3) yields: ‘if he really was in the habit of persuading his pupils that, even
about the future, neither a fortune-teller nor anyone else can judge better than one can
for oneself’.Theaetetus 199
SOCRATES : The more reason, then, my dear Theodorus, why we should
examine it by going back to its ﬁrst principle,24which is the way they e
present it themselves.
THEODORUS : I quite agree. You know, Socrates, these Heraclitean doc-
trines (or, as you say, Homeric or still more ancient) —you can’t discuss
them in person with any of the people at Ephesus who profess to be adepts,
any more than you could with a maniac. They are just like the things they
say in their books —always on the move. As for abiding by what is said,
or sticking to a question, or quietly answering and asking questions in turn, 180
there is less than nothing of that in their capacity. That ’s an exaggeration, no
doubt. I mean there isn’t so much as a tiny bit of repose in these people.
If you ask any one of them a question, he will pull out some little enigmatic
phrase from his quiver and shoot it off at you; and if you try to make him
give an account of what he has said, you will only get hit by another, full
of strange turns of language. You will never reach any conclusion with
any of them, ever; indeed they never reach any conclusion with each other,
they are so very careful not to allow anything to be stable, either in an b
argument or in their own souls. I suppose they think that if they did it
would be something that stands still —this being what they are totally at
war with, and what they are determined to banish from the universe, if
they can.
SOCRATES : I dare say, Theodorus, you have seen these men only on the
ﬁeld of battle, and never been with them in times of peace —as you don’t
belong to their set. I expect they keep such matters to be explained at
leisure to their pupils whom they want to make like themselves.
THEODORUS :Pupils, my good man? There are no pupils and teachers
among these people. They just spring up on their own, one here, one there, c
wherever they happen to catch their inspiration; and no one of them will
credit another with knowing anything. As I was just going to say, you
will never get these men to give an account of themselves, willingly or
unwillingly. What we must do is to take their doctrine out of their hands
and consider it for ourselves, as we should a problem in geometry.
SOCRATES : What you say is very reasonable. This problem now, we have
inherited it, have we not, from the ancients? They used poetical forms d
which concealed from the majority of men their real meaning, namely,
that Ocean and Tethys, the origin of all things, are actually ﬂowing streams,
and nothing stands still. In more modern times, the problem is presented
to us by men who, being more accomplished in these matters, plainly
demonstrate their meaning so that even shoemakers may hear and assimi-
late their wisdom, and give up the silly idea that some things in this world
stand still while others move, learn that all things are in motion, and
recognize the greatness of their instructors.
24. I.e., the principle that everything is really motion (156a).200 Theaetetus
But I was almost forgetting, Theodorus, that there are other thinkers
who have announced the opposite view; who tell us that ’Unmoved is the e
Universe’,25and other similar statements which we hear from a Melissus26
or a Parmenides as against the whole party of Heracliteans. These philoso-
phers insist that all things are One, and that this One stands still, itself
within itself, having no place in which to move.
What are we to do with all these people, my friend? We have been
gradually advancing till, without realizing it, we have got ourselves in
between the two parties; and if we don ’t in some way manage to put up 181
aﬁght and make our escape, we shall pay for it, like the people who play
that game on the line in the wrestling schools, and get caught by both
parties and pulled in opposite directions.
Now I think we ought to begin by examining the other party, the ﬂuent
fellows we started to pursue. If they appear to us to be talking sense, we
will help them to drag us over to their side, and try to escape the others.
But if those who make their stand for the whole appear to be nearer the
truth, we will take refuge with them from the men who ‘move what should b
not be moved’. And if it appears that neither party has a reasonable theory,
then we shall be very absurd if we think that insigni ﬁcant people like
ourselves can have anything to say, after we have rejected the views of men
who lived so long ago and possessed all wisdom. Think now, Theodorus, is
it of any use for us to go forward upon such a dangerous venture?
THEODORUS : We can’t refuse to examine the doctrines of these two schools,
Socrates; that couldn’t be allowed.
SOCRATES : Then we must examine them, if youfeel so strongly about it. c
Now it seems to me that the proper starting point of our criticism is the
nature of motion; what is this thing that they are talking about when they
say that all things are in motion? I mean, for example, are they referring
to one form of motion only, or, as I think, to two —but don’t let this be
only what Ithink. You commit yourself as well, so that we may come to
grief together, if need be. Tell me, do you call it ‘motion’ when a thing
changes from one place to another or turns round in the same place?
THEODORUS : I do, yes.
SOCRATES : Here then is one form of motion. Then supposing a thing
remains in the same place, but grows old, or becomes black instead of d
white, or hard instead of soft, or undergoes any other alteration; isn ’ti t
right to say that here we have motion in another form?
THEODORUS : Unquestionably.
SOCRATES : Then I now have two forms of motion, alteration and spa-
tial movement.
THEODORUS : Yes; and that’s quite correct.
SOCRATES : Then now that we have made this distinction, let us have a
talk with the people who allege that all things are in motion. Let us ask
25. Both the text and the sense of this quotation are uncertain.
26. Melissus of Samos was a ﬁfth-century follower of Parmenides.Theaetetus 201
them, ‘Do you hold that everything is in motion in both ways, that is, that e
it both moves through space and undergoes alteration? Or do you suggest
that some things are in motion in both ways, and some only in one or
the other?’
THEODORUS : Heaven knows, Ican’t answer that. I suppose they would
say, in both ways.
SOCRATES : Yes; otherwise, my friend, it will turn out that, in their view,
things are both moving and standing still; and it will be no more correct
to say that all things are in motion than to say that all things stand still.
THEODORUS : That’s perfectly true.
SOCRATES : Then since they must be in motion, and there is no such thing
anywhere as absence of motion, it follows that all things are always in 182
every kind of motion.
THEODORUS : Yes, that must be so.
SOCRATES : Then I want you to consider this point in their theory. As we
were saying, they hold that the genesis of things such as warmth and
whiteness occurs when each of them is moving, together with a perception,
in the space between the active and passive factors: the passive factor
thereby becoming percipient, but not a perception, while the active factor
becomes such or such, but not a quality —isn’t that so? But perhaps ‘quality’
seems a strange word to you; perhaps you don ’t quite understand it as a
general expression.27So I will talk about particular cases. What I mean is
that the active factor becomes not warmth or whiteness, but warm and b
white; and so on. You will remember, perhaps, that we said in the earlier
stages of the argument that there is nothing which in itself is just one
thing; and that this applies also to the active and passive factors. It is by
the association of the two with one another that they generate perceptions
and the things perceived; and in so doing, the active factor becomes such
and such, while the passive factor becomes percipient.
THEODORUS : Yes, I remember that, of course.
SOCRATES : Then we need not concern ourselves about other points in c
their doctrine, whether they mean what we say or something else. We
must keep our eyes simply upon the object of our discussion. We must
ask them this question: ‘According to you, all things move and ﬂow; isn’t
that so?’
THEODORUS : Yes.
SOCRATES : And they have both the motions that we distinguished, that
is to say, they both move and alter?
THEODORUS : That must be so, if they are to be wholly and completely
in motion.
SOCRATES : Now if they were only moving through space and not altering,
we should presumably be able to say what the moving things ﬂow? Or
how do we express it?
27. This is the ﬁrst occurrence in Greek of the word poiote ¯s,‘quality’ or‘what-sort-ness’,
coined by Plato from the interrogative adjective poios, ‘of what sort? ’.202 Theaetetus
THEODORUS : That’s all right.
SOCRATES : But since not even this abides, that what ﬂows ﬂows white, d
but rather it is in process of change, so that there is ﬂux of this very thing
also, the whiteness, and it is passing over into another color, lest it be
convicted of standing still in this respect —since that is so, is it possible to
give any name to a color which will properly apply to it?
THEODORUS : I don’t see how one could, Socrates; nor yet surely to any-
thing else of that kind, if, being in ﬂux, it is always quietly slipping away
as you speak?
SOCRATES : And what about any particular kind of perception; for exam-
ple, seeing or hearing? Does it ever abide, and remain seeing or hearing? e
THEODORUS : It ought not to, certainly, if all things are in motion.
SOCRATES : Then we may not call anything seeing rather than not-seeing;
nor indeed may we call it any other perception rather than not —if it be
admitted that all things are in motion in every way?
THEODORUS : No, we may not.
SOCRATES : Yet Theaetetus and I said that knowledge was perception?
THEODORUS : You did.
SOCRATES : And so our answer to the question, ‘What is knowledge?’
gave something which is no more knowledge than not.
THEODORUS : It seems as if it did. 183
SOCRATES :Aﬁne way this turns out to be of making our answer right.
We were most anxious to prove that all things are in motion, in order to
make that answer come out correct; but what has really emerged is that,
if all things are in motion, every answer, on whatever subject, is equally
correct, both ‘it is thus’ and ‘it is not thus’—or if you like ‘becomes’,a s
we don’t want to use any expressions which will bring our friends to
a standstill.
THEODORUS : You are quite right.
SOCRATES : Well, yes, Theodorus, except that I said ‘thus’ and ‘not thus’. b
One must not use even the word ‘thus’; for this ‘thus’ would no longer
be in motion; nor yet ‘not thus’ for here again there is no motion. The
exponents of this theory need to establish some other language; as it is,
they have no words that are consistent with their hypothesis —unless it
would perhaps suit them best to use ‘not at all thus’ in a quite indeﬁ-
nite sense.
THEODORUS : That would at least be an idiom most appropriate to them.
SOCRATES : Then we are set free from your friend, Theodorus. We do not c
yet concede to him that every man is the measure of all things, if he be
not a man of understanding. And we are not going to grant that knowledge
is perception, not at any rate on the line of inquiry which supposes that
all things are in motion; we are not going to grant it unless Theaetetus
here has some other way of stating it.
THEODORUS : That’s very good hearing, Socrates, for when these matters
were concluded I was to be set free from my task of answering you,Theaetetus 203
according to our agreement, which speciﬁed the end of the discussion of
Protagoras’ theory.
THEAETETUS : Oh, no, indeed, Theodorus! Not till you and Socrates have d
done what you proposed just now, and dealt with the other side, the
people who say that the Universe stands still.
THEODORUS : What’s this, Theaetetus? You at your age teaching your elders
to be unjust and break their agreements? What you have got to do is to pre-
pare to render account to Socrates yourself for the rest of the discussion.
THEAETETUS : All right, if he likes. But I would rather have listened to a
discussion of these views.
THEODORUS : Well, challenging Socrates to an argument is like inviting
‘cavalry into the plain’. So ask your questions and you shall hear.
SOCRATES : But I don’t think, Theodorus, that I am going to be persuaded
by Theaetetus to do what he demands. e
THEODORUS : But what is it makes you unwilling?
SOCRATES : Shame. I am afraid our criticism might be a very cheap affair.
And if I feel like this before the many who have made the universe one
and unmoved, Melissus and the rest of them, I feel it still more in the face
of the One—Parmenides. Parmenides seems to me, in the words of Homer,
to be ‘reverend’ and ‘awful’.28I met him when I was very young and he
was a very old man; and he seemed to me to have a wholly noble depth.29184
So I am afraid we might not understand even what he says; still less should
we attain to his real thought. Above all, I am afraid that the very object
of our discussion, the nature of knowledge, might be left unexamined
amid the crowd of theories that will rush in upon us if we admit them;
especially as the theory we have now brought up is one which involves
unmanageably vast issues. To treat it as a sideshow would be insult and
injury; while if it is adequately discussed, it is likely to spread out until
it completely eclipses the problems of knowledge. We must not do either.
What we must do is to make use of our midwife’s art to deliver Theaetetus b
of the thoughts which he has conceived about the nature of knowledge.*
THEODORUS : Well, if that is what you think proper, it must be done.
SOCRATES : Now, Theaetetus, I want you to think about one point in what
has been said. Your answer was that knowledge is perception, wasn’t it?
THEAETETUS : Yes.
SOCRATES : Now supposing you were asked: ‘With what does a man see
white and black things, and with what does he hear high and low notes?’
You would reply, I imagine, ‘With his eyes and ears.’
THEAETETUS : I should, yes.
28.Iliad iii.172.
29. A reference probablyto the discussion between Socrates andParmenides in Parmenides.
*Alternatively, this sentence could be translated: ‘What we must do is to make use of
our midwife’s art to set Theaetetus free from the thoughts which he has conceived about
the nature of knowledge’.204 Theaetetus
SOCRATES : Now as a rule it is no sign of ill-breeding to be easy in the c
use of language and take no particular care in one ’s choice of words; it is
rather the opposite that gives a man away. But such exactness is sometimes
necessary; and it is necessary here, for example, to fasten upon something
in your answer that is not correct. Think now. Is it more correct to say
that the eyes are that with which we see, or that through which we see?
Do we hear with the ears or through the ears?
THEAETETUS : Well, I should think, Socrates, that it is ‘through which’ we
perceive in each case, rather than ‘with which.’
SOCRATES : Yes, my son. It would be a very strange thing, I must say, if d
there were a number of perceptions sitting inside us as if we were Wooden
Horses, and there were not some single form, soul or whatever one ought
to call it, to which all these converge —something with which, through those
things,30as if they were instruments, we perceive all that is perceptible.
THEAETETUS : That sounds to me better than the other way of putting it.
SOCRATES : Now the reason why I am being so precise with you is this.
I want to know if it is with one and the same part of ourselves that we
reach, through our eyes to white and black things, and through the other e
means to yet further things; and whether, if asked, you will be able to
refer all these to the body. But perhaps it would be better if you stated
the answers yourself, rather than that I should busy myself on your behalf.
Tell me: the instruments through which you perceive hot, hard, light, sweet
things —do you consider that they all belong to the body? Or can they be
referred elsewhere?
THEAETETUS : No, they all belong to the body.
SOCRATES : And are you also willing to admit that what you perceive
through one power, you can’t perceive through another? For instance, 185
what you perceive through hearing, you couldn’t perceive through sight,
and similarly what you perceive through sight you couldn ’t perceive
through hearing?
THEAETETUS : I could hardly refuse to grant that.
SOCRATES : Then suppose you think something about both; you can ’t
possibly be having a perception about both, either through one of these
instruments or through the other?
THEAETETUS : No.
SOCRATES : Now take a sound and a color. First of all, don ’t you think
this same thing about both of them, namely, that they both are?
THEAETETUS : I do.
SOCRATES : Also that each of them is different from the other and the
same as itself?
THEAETETUS : Of course. b
SOCRATES : And that both together are two, and each of them is one?
THEAETETUS : Yes, I think that too.
30. Viz., the eyes and ears.Theaetetus 205
SOCRATES : Are you also able to consider whether they are like or unlike
each other?
THEAETETUS : Yes, I may be.
SOCRATES : Now what is it through which you think all these things about
them? It is not possible, you see, to grasp what is common to both either
through sight or through hearing. Let us consider another thing which
will show the truth of what we are saying. Suppose it were possible to
inquire whether both are salty or not. You can tell me, of course, with c
what you would examine them. It would clearly be neither sight nor
hearing, but something else.
THEAETETUS : Yes, of course; the power which functions through the
tongue.
SOCRATES : Good. Now through what does that power function which
reveals to you what is common in the case both of all things and of these
two—I mean that which you express by the words ‘is’and ‘is not’ and
the other terms used in our questions about them just now? What kind
of instruments will you assign for all these? Through what does that which
is percipient in us perceive all of them?
THEAETETUS : You mean being and not-being, likeness and unlikeness,
same and different; also one, and any other number applied to them. And d
obviously too your question is about odd and even, and all that is involved
with these attributes; and you want to know through what bodily instru-
ments we perceive all these with the soul.
SOCRATES : You follow me exceedingly well, Theaetetus. These are just
the things I am asking about.
THEAETETUS : But Icouldn’t possibly say. All I can tell you is that it doesn ’t
seem to me that for these things there is any special instrument at all, as
there is for the others. It seems to me that in investigating the common e
features of everything the soul functions through itself.
SOCRATES : Yes, Theaetetus, you would say that, because you are hand-
some and not ugly as Theodorus would have it.31For handsome is as
handsome says. And besides being handsome, you have done me a good
turn; you have saved me a vast amount of talk if it seems to you that,
while the soul considers some things through the bodily powers, there are
others which it considers alone and through itself. This was what I thought
myself, but I wanted you to think it too.
THEAETETUS : Well, it does seem to me to be so. 186
SOCRATES : Now in which class do you put being? For that, above all, is
something that accompanies everything.
THEAETETUS : I should put it among the things which the soul itself reaches
out after by itself.
SOCRATES : Also like and unlike, same and different?
THEAETETUS : Yes.
SOCRATES : What about beautiful and ugly, good and bad?
31. Cf. 143e.206 Theaetetus
THEAETETUS : Yes, these too; in these, above all, I think the soul examines
their being in comparison with one another. Here it seems to be making b
a calculation within itself of past and present in relation to future.
SOCRATES : Not so fast, now. Wouldn’t you say that it is through touch
that the soul perceives the hardness of what is hard, and similarly the
softness of what is soft?
THEAETETUS : Yes.
SOCRATES : But as regards their being —the fact that they are —their oppo-
sition to one another, and the being, again, of this opposition, the matter
is different. Here the soul itself attempts to reach a decision for us by
rising to compare them with one another.
THEAETETUS : Yes, undoubtedly.
SOCRATES : And thus there are some things which all creatures, men and c
animals alike, are naturally able to perceive as soon as they are born; I mean,
the experiences which reach the soul through the body. But calculations
regarding their being and their advantageousness come, when they do,
only as the result of a long and arduous development, involving a good
deal of trouble and education.
THEAETETUS : Yes, that certainly is so.
SOCRATES : Now is it possible for someone who does not even get at being
to get at truth?
THEAETETUS : No; it’s impossible.
SOCRATES : And if a man fails to get at the truth of a thing, will he ever
be a person who knows that thing?
THEAETETUS : I don’t see how, Socrates. d
SOCRATES : Then knowledge is to be found not in the experiences but in
the process of reasoning about them; it is here, seemingly, not in the
experiences, that it is possible to grasp being and truth.
THEAETETUS : So it appears.
SOCRATES : Then in the face of such differences, would you call both by
the same name?
THEAETETUS : One would certainly have no right to.
SOCRATES : Now what name do you give to the former —seeing, hearing,
smelling, feeling cold or warm?
THEAETETUS : I call that perceiving —what else could I call it? e
SOCRATES : So the whole lot taken together you call perception?
THEAETETUS : Necessarily.
SOCRATES : Which, we say, has no share in the grasping of truth, since it
has none in the grasping of being.
THEAETETUS : No, it has none.
SOCRATES : So it has no share in knowledge either.
THEAETETUS : No.
SOCRATES : Then, Theaetetus, perception and knowledge could never be
the same thing.
THEAETETUS : No, apparently not, Socrates; we have now got the clearest
possible proof that knowledge is something different from perception.Theaetetus 207
SOCRATES : But our object in beginning this discussion was not to ﬁnd 187
out what knowledge is not, but to ﬁnd out what it is. However, we have
made a little progress. We shall not now look for knowledge in sense-
perception at all, but in whatever we call that activity of the soul when it
is busy by itself about the things which are.
THEAETETUS : Well, the name, Socrates, I suppose is judgment.
SOCRATES : Your opinion, my dear lad, is correct. Now look back to the
beginning. Wipe out all that we have said hitherto, and see if you can see b
any better from where you have now progressed to. Tell me again, what
is knowledge?
THEAETETUS : Well, Socrates, one can’t say that it is judgment in general,
because there is also false judgment —but true judgment may well be
knowledge. So let that be my answer. If the same thing happens again, and
weﬁnd, as we go on, that it turns out not to be so, we’ll try something else.
SOCRATES : And even so, Theaetetus, you have answered me in the way
one ought —with a good will, and not reluctantly, as you did at ﬁrst. If c
we continue like this, one of two things will happen. Either we shall ﬁnd
what we are going out after; or we shall be less inclined to think we know
things which we don’t know at all —and even that would be a reward we
could not fairly be dissatisﬁed with. Now what is this that you say? There
are two forms of judgment, true and false; and your deﬁnition is that true
judgment is knowledge?
THEAETETUS : Yes. That is how it looks to me now.
SOCRATES : Now I wonder if it’s worth while, at this stage, to go back to
an old point about judgment —
THEAETETUS : What point do you mean?
SOCRATES : I have something on my mind which has often bothered me d
before, and got me into great difﬁculty, both in my own thought and in
discussion with other people —I mean, I can’t say what it is, this experience
we have, and how it arises in us.
THEAETETUS : What experience?
SOCRATES : Judging what is false. Even now, you know, I’m still consider-
ing; I’m in two minds whether to let it go or whether to look into it in a
different manner from a short while ago.
THEAETETUS : Why not, Socrates, if this appears for any reason to be the
right thing to do? As you and Theodorus were saying just now, and quite
rightly, when you were talking about leisure, we are not pressed for time
in talk of this kind.
SOCRATES : A very proper reminder. Perhaps it would not be a bad mo- e
ment to go back upon our tracks. It is better to accomplish a little well
than a great deal unsatisfactorily.
THEAETETUS : Yes, it certainly is.
SOCRATES : Now how are we to proceed? And actually what is it that we
are saying? We claim, don’t we, that false judgment repeatedly occurs and
one of us judges falsely, the other truly, as if it was in the nature of things
for this to happen?208 Theaetetus
THEAETETUS : That is what we claim.
SOCRATES : Now isn’t it true about all things, together or individually, 188
that we must either know them or not know them? I am ignoring for the
moment the intermediate conditions of learning and forgetting, as they
don’t affect the argument here.
THEAETETUS : Of course, Socrates, in that case there is no alternative. With
each thing we either know it or we do not.
SOCRATES : Then when a man judges, the objects of his judgment are
necessarily either things which he knows or things which he doesn’t know?
THEAETETUS : Yes, that must be so.
SOCRATES : Yet if he knows a thing, it is impossible that he should not
know it; or if he does not know it, he cannot know it. b
THEAETETUS : Yes, of course.
SOCRATES : Now take the man who judges what is false. Is he thinking
that things which he knows are not these things but some other things
which he knows —so that knowing both he is ignorant of both?
THEAETETUS : But that would be impossible, Socrates.
SOCRATES : Then is he imagining that things which he doesn’t know are
other things which he doesn’t know? Is it possible that a man who knows
neither Theaetetus nor Socrates should take it into his head that Socrates
is Theaetetus or Theaetetus Socrates?
THEAETETUS : I don’t see how that could happen. c
SOCRATES : But a man certainly doesn’t think that things he knows are
things he does not know, or again that things he doesn’t know are things
he knows.
THEAETETUS : No, that would be a very odd thing.
SOCRATES : Then in what way is false judgment still possible? There is
evidently no possibility of judgment outside the cases we have mentioned,
since everything is either a thing we know or a thing we don’t know; and
within these limits there appears to be no place for false judgment to
be possible.
THEAETETUS : That’s perfectly true.
SOCRATES : Then perhaps we had better take up a different line of inquiry;
perhaps we should proceed not by way of knowing and not-knowing, but d
by way of being and not-being?
THEAETETUS : How do you mean?
SOCRATES : Perhaps the simple fact is this: it is when a man judges about
anything things which are not, that he is inevitably judging falsely, no
matter what may be the nature of his thought in other respects.
THEAETETUS : That again is very plausible, Socrates.
SOCRATES : Now how will that be? What are we going to say, Theaetetus,
if somebody sets about examining us, and we are asked, ‘Is what these
words express possible for anyone? Can a man judge what is not, either
about one of the things which are, or just by itself?’ I suppose we shall e
reply, ‘Yes, when he is thinking, but thinking what is not true.’ Or how
shall we answer?Theaetetus 209
THEAETETUS : That’s our answer.
SOCRATES : Now does this kind of thing happen elsewhere?
THEAETETUS : What kind of thing?
SOCRATES : Well, for instance, that a man sees something, yet sees nothing.
THEAETETUS : How could he?
SOCRATES : On the contrary, in fact, if he is seeing any one thing, he must
be seeing a thing which is. Or do you think that a ‘one’ can be found
among the things which are not?
THEAETETUS : I certainly don’t.
SOCRATES : Then a man who is seeing any one thing is seeing something
which is?
THEAETETUS : Apparently.
SOCRATES : It also follows that a man who is hearing anything is hearing 189
some one thing and something which is.
THEAETETUS : Yes.
SOCRATES : And a man who is touching anything is touching some one
thing, and a thing which is, if it is one?
THEAETETUS : Yes, that also follows.
SOCRATES : And a man who is judging is judging some one thing, is he not?
THEAETETUS : Necessarily.
SOCRATES : And a man who is judging some one thing is judging some-
thing which is?
THEAETETUS : I grant that.
SOCRATES : Then that means that a man who is judging something which
is not is judging nothing?
THEAETETUS : So it appears.
SOCRATES : But a man who is judging nothing is not judging at all.
THEAETETUS : That seems clear.
SOCRATES : And so it is not possible to judge what is not, either about b
the things which are or just by itself.
THEAETETUS : Apparently not.
SOCRATES : False judgment, then, is something different from judging
things which are not?
THEAETETUS : It looks as if it were.
SOCRATES : Then neither on this approach nor on the one we followed
just now does false judgment exist in us.
THEAETETUS : No, indeed.
SOCRATES : Then is it in this way that the thing we call by that name arises?
THEAETETUS : How?
SOCRATES : We say that there is false judgment, a kind of ‘other-judging’, c
when a man, in place of one of the things that are, has substituted in his
thought another of the things that are and asserts that it is.32In this way,
32. Reading [anti tinos] for Burnet’s [ti] at 189c1; the latter reading would yield: ‘when
a man asserts that one of the things which are is another of the things which are, having
substituted one for the other in his thought’.210 Theaetetus
he is always judging something which is, but judges one thing in place of
another; and having missed the thing which was the object of his consider-
ation, he might fairly be called one who judges falsely.
THEAETETUS : Now you seem to me to have got it quite right. When a
man judges ‘ugly’ instead of ‘beautiful’,o r ‘beautiful’ instead of ‘ugly’,
then he is truly judging what is false.
SOCRATES : Evidently, Theaetetus, you have not much opinion of me; you
don’t ﬁnd me at all alarming.
THEAETETUS : What in particular makes you say that?
SOCRATES : Well, I suppose you don’t think me capable of taking up your d
‘truly false’, and asking you whether it is possible that a thing should be
slowly swift, or heavily light, or whether anything else can possibly occur
in a way not in accordance with its own nature but in accordance with
that of its opposite and contrary to itself. But let that pass; I don’t want
your boldness to go unrewarded. You like the suggestion, you say, that
false judgment is ‘other-judging’?
THEAETETUS : Yes, I do.
SOCRATES : Then, according to your judgment, it is possible to set down
a thing in one’s thought as another thing and not itself?
THEAETETUS : Surely it is.
SOCRATES : Now when a man’s thought is accomplishing this, isn’t it e
essential that he should be thinking of either one or both of these two
things?
THEAETETUS : It is essential; either both together, or each in turn.
SOCRATES : Very good. Now by ‘thinking’ do you mean the same as I do?
THEAETETUS : What do you mean by it?
SOCRATES : A talk which the soul has with itself about the objects under
its consideration. Of course, I’m only telling you my idea in all ignorance;
but this is the kind of picture I have of it. It seems to me that the soul
when it thinks is simply carrying on a discussion in which it asks itself 190
questions and answers them itself, afﬁrms and denies. And when it arrives
at something deﬁnite, either by a gradual process or a sudden leap, when
it afﬁrms one thing consistently and without divided counsel, we call this
its judgment. So, in my view, to judge is to make a statement, and a
judgment is a statement which is not addressed to another person or
spoken aloud, but silently addressed to oneself. And what do you think?
THEAETETUS : I agree with that.
SOCRATES : So that when a man judges one thing to be another, what he
is doing, apparently, is to say to himself that the one thing is the other.
THEAETETUS : Yes, of course. b
SOCRATES : Now try to think if you have ever said to yourself ‘Surely the
beautiful is ugly’,33or ‘The unjust is certainly just’. Or—to put it in the
most general terms—have you ever tried to persuade yourself that ‘Surely
33. The Greek idiom here could be used to say either that some particular beautiful
thing is ugly, or that beauty is ugliness.Theaetetus 211
one thing is another ’? Wouldn’t the very opposite of this be the truth?
Wouldn’t the truth be that not even in your sleep have you ever gone so
far as to say to yourself ‘No doubt the odd is even ’, or anything of that kind?
THEAETETUS : Yes, that’s so.
SOCRATES : And do you think that anyone else, in his right mind or out c
of it, ever ventured seriously to tell himself, with the hope of winning his
own assent, that ‘A cow must be a horse ’or‘Two must be one ’?
THEAETETUS : No, indeed I don ’t.
SOCRATES : Well, then, if to make a statement to oneself is to judge, no
one who makes a statement, that is, a judgment, about both things, getting
hold of both with his soul, can state, or judge, that one is the other. And
you, in your turn, must let this form of words pass.34What I mean by it
is this: no one judges ‘The ugly is beautiful ’or makes any other such d
judgment.
THEAETETUS : All right, Socrates, I pass it; and I think you ’re right.
SOCRATES : Thus a man who has both things before his mind when he
judges cannot possibly judge that one is the other.
THEAETETUS : So it seems.
SOCRATES : But if he has only one of them before his mind in judging,
and the other is not present to him at all, he will never judge that one is
the other.
THEAETETUS : That’s true. For he would have to have hold also of the one
that is not present to his judgment.
SOCRATES : Then ‘other-judging’ is not possible for anyone either when
he has both things present to him in judgment or when he has one only. e
So, if anyone is going to de ﬁne false judgment as ‘heterodoxy’,35he will
be saying nothing. The existence of false judgment in us cannot be shown
in this way any more than by our previous approaches.
THEAETETUS : It seems not.
SOCRATES : And yet, Theaetetus, if it is not shown to exist, we shall be
driven into admitting a number of absurdities.
THEAETETUS : And what would they be?
SOCRATES : I am not going to tell you until I have tried every possible
way of looking at this matter. I should be ashamed to see us forced into 191
making the kind of admissions I mean while we are still in dif ﬁculties. If
weﬁnd what we’re after, and become free men, then we will turn round
and talk about how these things happen to other people —having secured
our own persons against ridicule. While if we can’t ﬁnd any way of
34. In the Greek the opposition here between ‘one’ and ‘the other’ is expressed by
the repetition of the word meaning ‘other’—thus yielding, literally, the unparadoxical
tautology ‘the other is other’. As Socrates refrained at 189c –d from taking up the paradoxi-
cal construal of Theaetetus’‘ truly false’, so Theaetetus must refrain from taking up this
unparadoxical construal of Socrates ’‘one is the other ’.
35. A transliteration of a variant Greek expression for ‘other-judging’ that Socrates
uses here.212 Theaetetus
extricating ourselves, then I suppose we shall be laid low, like seasick
passengers, and give ourselves into the hands of the argument and let it
trample all over us and do what it likes with us. And now let me tell you
where I see a way still open to this inquiry.
THEAETETUS : Yes, do tell me.
SOCRATES : I am going to maintain that we were wrong to agree that it
is impossible for a man to be in error through judging that things he knows b
are things he doesn’t know. In a way, it is possible.
THEAETETUS : Now I wonder if you mean the same thing as I too suspected
at the time when we suggested it was like that —I mean, that sometimes
I, who know Socrates, have seen someone else in the distance whom I
don’t know and thought it to be Socrates whom I do know. In a case like
that, the sort of thing you are referring to does happen.
SOCRATES : But didn’t we recoil from this suggestion because it made us
not know, when we do know, things which we know?
THEAETETUS : Yes, we certainly did.
SOCRATES : Then don’t let us put the case in that way; let‘s try another
way. It may prove amenable or it may be obstinate; but the fact is we are c
in such an extremity that we need to turn every argument over and over
and test it from all sides. Now see if there is anything in this. Is it possible
to learn something you didn’t know before?
THEAETETUS : Surely it is.
SOCRATES : And again another and yet another thing?
THEAETETUS : Well, why not?
SOCRATES : Now I want you to suppose, for the sake of the argument,
that we have in our souls a block of wax, larger in one person, smaller in
another, and of purer wax in one case, dirtier in another; in some men rather d
hard, in others rather soft, while in some it is of the proper consistency.
THEAETETUS : All right, I’m supposing that.
SOCRATES : We may look upon it, then, as a gift of Memory, the mother
of the Muses. We make impressions upon this of everything we wish to
remember among the things we have seen or heard or thought of ourselves;
we hold the wax under our perceptions and thoughts and take a stamp
from them, in the way in which we take the imprints of signet rings.
Whatever is impressed upon the wax we remember and know so long as
the image remains in the wax; whatever is obliterated or cannot be im- e
pressed, we forget and do not know.
THEAETETUS : Let that be our supposition.
SOCRATES : Then take the case of a man who knows these things, but is
also considering something he is seeing or hearing; and see if he might
judge falsely in this way.
THEAETETUS : In what kind of way?
SOCRATES : In thinking, of things which he knows, sometimes that they
are things which he knows and sometimes that they are things which he
doesn’t know —these cases being what at an earlier stage we wrongly
admitted to be impossible.
THEAETETUS : And what do you say now?Theaetetus 213
SOCRATES : We must begin this discussion by making certain distinctions. 192
We must make it clear that it is impossible to think (1) that a thing you
know, because you possess the record of it in your soul, but which you
are not perceiving, is another thing which you know —you have its imprint
too—but are not perceiving, (2) that a thing you know is something you
do not know and do not have the seal of, (3) that a thing you don’t know
is another thing you don’t know, (4) that a thing you don’t know is a thing
you know.
Again, it is impossible to think (1) that a thing you are perceiving is
another thing that you are perceiving, (2) that a thing you are perceiving
is a thing which you are not perceiving, (3) that a thing you are not b
perceiving is another thing you are not perceiving, (4) that a thing you
are not perceiving is a thing you are perceiving.
Yet again, it is impossible to think (1) that a thing you both know and are
perceiving, when you are holding its imprint in line with your perception of
it, is another thing which you know and are perceiving, and whose imprint
you keep in line with the perception (this indeed is even more impossible
than the former cases, if that can be), (2) that a thing which you both know
and are perceiving, and the record of which you are keeping in its true
line, is another thing you know, (3) that a thing you both know and are
perceiving and of which you have the record correctly in line as before,
is another thing you are perceiving, (4) that a thing you neither know nor c
are perceiving is another thing you neither know nor perceive, (5) that a
thing you neither know nor perceive is another thing you don’t know,
(6) that a thing you neither know nor perceive is another thing you are
not perceiving.
In all these cases, it is a sheer impossibility that there should be false
judgment. It remains that it arises, if anywhere, in the cases I am just going
to tell you.
THEAETETUS : What are they? Perhaps I may understand a little better
from them; at present, I don’t follow.
SOCRATES : In these cases of things you know: when you think (1) that
they are other things you know and are perceiving, (2) that they are things
you don’t know but are perceiving, (3) that things you both know and are d
perceiving are other things you both know and are perceiving.
THEAETETUS : Well, now you have left me further behind than ever.
SOCRATES :I’ll go over it again in another way. I know Theodorus and
remember within myself what he is like; and in the same way I know
Theaetetus. But sometimes I am seeing them and sometimes not; sometimes
I am touching them, and sometimes not; or I may hear them or perceive
them through some other sense, while at other times I have no perception
about you two at all, but remember you none the less, and know you
within myself —isn’t that so?
THEAETETUS : Yes, certainly. e
SOCRATES : Now please take this ﬁrst point that I want to make clear to
you—that we sometimes perceive and sometimes do not perceive the
things that we know.214 Theaetetus
THEAETETUS : That’s true.
SOCRATES : Then as regards the things we don’t know, we often don’t
perceive them either, but often we only perceive them.
THEAETETUS : That is so, also.
SOCRATES : Now see if you can follow me a little better. Supposing Socrates 193
knows both Theodorus and Theaetetus, but is not seeing either of them,
or having any other perception about them: he could never in that case
judge within himself that Theaetetus was Theodorus. Is that sense or not?
THEAETETUS : Yes, that’s quite true.
SOCRATES : This, then, was the ﬁrst of the cases I was speaking of.
THEAETETUS : It was.
SOCRATES : Secondly then. Supposing I am acquainted with one of you
and not the other, and am perceiving neither of you: in that case, I could
never think the one I do know to be the one I don’t know.
THEAETETUS : That is so.
SOCRATES : Thirdly, supposing I am not acquainted with either of you, b
and am not perceiving either of you: I could not possibly think that one
of you, whom I don’t know, is another of you whom I don’t know. Now
will you please take it that you have heard all over again in succession
the other cases described before —the cases in which I shall never judge
falsely about you and Theodorus, either when I am familiar or when I am
unfamiliar with both of you; or when I know one and not the other. And
similarly with perceptions, you follow me.
THEAETETUS : I follow.
SOCRATES : So there remains the possibility of false judgment in this case.
I know both you and Theodorus; I have your signs upon that block of c
wax, like the imprints of rings. Then I see you both in the distance, but
cannot see you well enough; but I am in a hurry to refer the proper sign
to the proper visual perception, and so get this ﬁtted into the trace of itself,
that recognition may take place. This I fail to do; I get them out of line,
applying the visual perception of the one to the sign of the other. It is like
people putting their shoes on the wrong feet, or like what happens when
we look at things in mirrors, when left and right change places. It is then d
that ‘heterodoxy’ or false judgment arises.
THEAETETUS : Yes, that seems very likely, Socrates; it is an awfully good
description of what happens to the judgment.
SOCRATES : Then, again, supposing I know both of you, and am also
perceiving one of you, and not the other, but am not keeping my knowledge
of the former in line with my perception —that’s the expression I used
before and you didn’t understand me then.
THEAETETUS : No, I certainly didn’t.
SOCRATES : Well, I was saying that if you know one man and perceive
him as well, and keep your knowledge of him in line with your perception, e
you will never take him for some other person whom you know and are
perceiving, and the knowledge of whom you are holding straight with the
perception. Wasn’t that so?
THEAETETUS : Yes.Theaetetus 215
SOCRATES : There remained, I take it, the case we have just mentioned
where false judgment arises in the following manner: you know both men 194
and you are looking at both, or having some other perception of them;
and you don’t hold the two signs each in line with its own perception,
but like a bad archer you shoot beside the mark and miss—which is
precisely what we call falsehood.
THEAETETUS : Naturally so.
SOCRATES : And when for one of the signs there is also a present perception
but there is not for the other, and you try to ﬁt to the present perception the
sign belonging to the absent perception, in all such cases thought is in error.
We may sum up thus: it seems that in the case of things we do not b
know and have never perceived, there is no possibility of error or of false
judgment, if what we are saying is at all sound; it is in cases where we
both know things and are perceiving them that judgment is erratic and
varies between truth and falsity. When it brings together the proper stamps
and records directly and in straight lines, it is true; when it does so obliquely
and crosswise, it is false.
THEAETETUS : Well, isn’t that beautiful, Socrates?
SOCRATES : Ah, when you’ve heard what is coming next, you will say so c
all the more. For true judgment is beautiful, right enough, and error is ugly.
THEAETETUS : No doubt about that.
SOCRATES : Well, this, then, they say, is why the two things occur. In some
men, the wax in the soul is deep and abundant, smooth and worked to
the proper consistency; and when the things that come through the senses
are imprinted upon this ‘heart’ of the soul—as Homer calls it, hinting at
the likeness to the wax36—the signs that are made in it are lasting, because d
they are clear and have sufﬁcient depth. Men with such souls learn easily
and remember what they learn; they do not get the signs out of line with
the perceptions, but judge truly. As the signs are distinct and there is
plenty of room for them, they quickly assign each thing to its own impress
in the wax—the things in question being, of course, what we call the things
that are and these people being the ones we call wise.
Or do you feel any doubts about this?
THEAETETUS : No, I ﬁnd it extraordinarily convincing.
SOCRATES : But it is a different matter when a man’s ‘heart’ is ‘shaggy’ e
(the kind of heart our marvellously knowing poet praises), or when it is
dirty and of impure wax; or when it is very soft or hard. Persons in whom
the wax is soft are quick to learn but quick to forget; when the wax is
hard, the opposite happens. Those in whom it is ‘shaggy’ and rugged, a
stony thing with earth or ﬁlth mixed all through it, have indistinct impres-
sions. So too if the wax is hard, for then the impressions have no depth;
similarly they are indistinct if the wax is soft, because they quickly run 195
together and are blurred. If, in addition to all this, the impresses in the
wax are crowded upon each other for lack of space, because it is only
36.Iliad ii.851, xvi.554. The word for ‘heart’ attributed to Homer here is kear, which has
a superﬁcial resemblance to the word for wax, ke¯ros.216 Theaetetus
some little scrap of a soul, they are even more indistinct. All such people
are liable to false judgment. When they see or hear or think of anything,
they can’t quickly allot each thing to each impress; they are slow and allot
things to impresses which do not belong to them, misseeing, mishearing
and misthinking most of them —and these in turn are the ones we describe
as in error about the things that are and ignorant.
THEAETETUS : That’s exactly it, Socrates; no man could improve on b
your account.
SOCRATES : Then are we to say that false judgments do exist in us?
THEAETETUS : Yes, most emphatically.
SOCRATES : And true ones, of course?
THEAETETUS : And true ones.
SOCRATES : And we think we have now reached a satisfactory agreement,
when we say that these two kinds of judgment certainly exist?
THEAETETUS : There’s no earthly doubt about it, Socrates.
SOCRATES : Theaetetus, I’m afraid a garrulous man is really an awful nui-
sance.
THEAETETUS : Why, what are you talking about?
SOCRATES :I’m annoyed at my own stupidity —my own true garrulous- c
ness. What else could you call it when a man will keep dragging arguments
up and down, because he is too slow-witted to reach any conviction, and
will not be pulled off any of them?
THEAETETUS : But why should yoube annoyed?
SOCRATES : I am not only annoyed; I am alarmed. I am afraid of what I
may say if someone asks me: ‘So, Socrates, you’ve discovered false judg-
ment, have you? You have found that it arises not in the relation of
perceptions to one another, or of thoughts to one another, but in the d
connecting of perception with thought?’ I believe I am very likely to say
‘Yes’, with an air of ﬂattering myself upon our having made some beauti-
ful discovery.
THEAETETUS : Well, Socrates, what you have just shown us looks to me
quite a presentable thing anyway.
SOCRATES :‘You mean’, he goes on, ‘that we would never suppose that
a man we are merely thinking of but not seeing is a horse which again
we are not seeing or touching, but just thinking of and not perceiving
anything else about it?’ I suppose I shall agree that we do mean this.
THEAETETUS : Yes, and quite rightly.
SOCRATES :’Well then,’ he goes on, ‘doesn’t it follow from this theory e
that a man couldn’t possibly suppose that eleven, which he is merely
thinking about, is twelve, which again he is merely thinking about?’ Come
now, you answer.
THEAETETUS : Well, my answer will be that someone who is seeing or
touching them could suppose that eleven are twelve, but not with those that
he has in his thought: he would never judge this in that way about them.
SOCRATES : Well, now, take the case where a man is considering ﬁve and 196
seven within himself —I don’t mean seven men and ﬁve men, or anythingTheaetetus 217
of that sort, but ﬁve and seven themselves; the records, as we allege, in
that waxen block, things among which it is not possible that there should
be false judgment. Suppose he is talking to himself about them, and asking
himself how many they are. Do you think that in such a case it has ever
happened that one man thought they were eleven and said so, while
another thought and said that they were twelve? Or do all men say and
all men think that they are twelve?
THEAETETUS : Oh, good Heavens, no; lots of people would make them b
eleven. And with larger numbers they go wrong still more often —for I
suppose what you say is intended to apply to all numbers.
SOCRATES : Quite right. And I want you to consider whether what happens
here is not just this, that a man thinks that twelve itself, the one on the
waxen block, is eleven.
THEAETETUS : It certainly looks as if he does.
SOCRATES : Then haven’t we come back to the things we were saying at
the outset? You see, anyone to whom this happens is thinking that one
thing he knows is another thing he knows. And this we said was impossible;
in fact, it was just this consideration which led us to exclude the possibility
of false judgment, because, if admitted, it would mean that the same man c
must, at one and the same time, both know and not know the same objects.
THEAETETUS : That’s perfectly true.
SOCRATES : Then we shall have to say that false judgment is something
other than a misapplication of thought to perception; because if this were
so, we could never be in error so long as we remained within our thoughts
themselves. But as the matter now stands, either there is no such thing
as false judgment; or a man may not know what he knows. Which do
you choose?
THEAETETUS : You are offering me an impossible choice, Socrates.
SOCRATES : But I’m afraid the argument will not permit both. Still — d
we must stop at nothing; supposing now we were to set about being
quite shameless?
THEAETETUS : How?
SOCRATES : By consenting to say what knowing is like.
THEAETETUS : And why should that be shameless?
SOCRATES : You don’t seem to realize that our whole discussion from the
beginning has been an inquiry about knowledge, on the assumption that
we do not yet know what it is.
THEAETETUS :O hb u tId o .
SOCRATES : Well, then, don’t you think it is a shameless thing that we,
who don’t know what knowledge is, should pronounce on what knowing e
is like? But as a matter of fact, Theaetetus, for some time past our whole
method of discussion has been tainted. Time and again we have said ‘we
are acquainted with’ and ‘we are not acquainted with’, ‘we know’ and
‘we do not know’, as if we could to some extent understand one another
while we are still ignorant of what knowledge is. Or here’s another example,
if you like: at this very moment, we have again used the words ‘to be218 Theaetetus
ignorant of’, and ‘to understand’, as if these were quite proper expressions
for us when we are deprived of knowledge.
THEAETETUS : But how are you going to carry on the discussion at all,
Socrates, if you keep off these words?
SOCRATES : Quite impossible, for a man like me; but if I were one of the 197
experts in contradiction, I might be able to. If one of those gentlemen were
present, he would have commanded us to refrain from them, and would
keep coming down upon us heavily for the faults I’m referring to. But
since we are no good anyway, why don’t I make bold to tell you what
knowing is like? It seems to me that this might be of some help.
THEAETETUS : Then do be bold, please. And if you don’t keep from using
these words, we’ll forgive you all right.
SOCRATES : Well, then, have you heard what people are saying nowadays
that knowing is?
THEAETETUS : I dare say I have; but I don’t remember it at the moment.
SOCRATES : Well, they say, of course, that it is ‘the having of knowledge’. b
THEAETETUS : Oh, yes, that’s true.
SOCRATES : Let us make a slight change; let us say ‘the possession of
knowledge’.
THEAETETUS : And how would you say that was different from the ﬁrst
way of putting it?
SOCRATES : Perhaps it isn’t at all; but I will tell you what I think the
difference is, and then you must help me to examine it.
THEAETETUS : All right —if I can.
SOCRATES : Well, then, to ‘possess’ doesn’t seem to me to be the same as
to‘have’. For instance, suppose a man has bought a coat and it is at his
disposal but he is not wearing it; we would not say that he ‘has’ it on, but
we would say he ‘possesses’ it.
THEAETETUS : Yes, that would be correct.
SOCRATES : Now look here: is it possible in this way to possess knowledge c
and not ‘have’ it? Suppose a man were to hunt wild birds, pigeons or
something, and make an aviary for them at his house and look after them
there; then, in a sense, I suppose, we might say he ‘has’ them all the time,
because of course he possesses them. Isn’t that so?
THEAETETUS : Yes.
SOCRATES : But in another sense he ‘has’ none of them; it is only that he
has acquired a certain power in respect of them, because he has got them
under his control in an enclosure of his own. That is to say, he has the d
power to hunt for any one he likes at any time, and take and ‘have’ it
whenever he chooses, and let it go again; and this he can do as often as
he likes.
THEAETETUS : That is so.
SOCRATES : Well a little while ago we were equipping souls with I don’t
know what sort of a waxen device. Now let us make in each soul a sort
of aviary of all kinds of birds; some in ﬂocks separate from the others,Theaetetus 219
some in small groups, and others ﬂying about singly here and there among
all the rest.
THEAETETUS : All right, let us suppose it made. What then? e
SOCRATES : Then we must say that when we are children this receptacle
is empty; and by the birds we must understand pieces of knowledge.
When anyone takes possession of a piece of knowledge and shuts it up
in the pen, we should say that he has learned or has found out the thing
of which this is the knowledge; and knowing, we should say, is this.
THEAETETUS : That’s given, then.
SOCRATES : Now think: when he hunts again for any one of the pieces of 198
knowledge that he chooses, and takes it and ‘has’ it, then lets it go again,
what words are appropriate here? The same as before, when he took
possession of the knowledge, or different ones? —You will see my point
more clearly in this way. There is an art you call arithmetic, isn’t there?
THEAETETUS : Yes.
SOCRATES : Now I want you to think of this as a hunt for pieces of
knowledge concerning everything odd and even.
THEAETETUS : All right, I will.
SOCRATES : It is by virtue of this art, I suppose, that a man both has under b
his control pieces of knowledge concerning numbers and also hands them
over to others?
THEAETETUS : Yes.
SOCRATES : And we call it ‘teaching’ when a man hands them over to
others, and ‘learning’ when he gets them handed over to him; and when
he‘has’ them through possessing them in this aviary of ours, we call
that ‘knowing’.
THEAETETUS : Yes, certainly.
SOCRATES : Now you must give your attention to what is coming next.
It must surely be true that a man who has completely mastered arithmetic
knows all numbers? Because there are pieces of knowledge covering all
numbers in his soul.
THEAETETUS : Of course.
SOCRATES : And a man so trained may proceed to do some counting, c
either counting to himself the numbers themselves, or counting something
else, one of the external things which have number?
THEAETETUS : Yes, surely.
SOCRATES : And counting we shall take to be simply a matter of consider-
ing how large a number actually is?
THEAETETUS : Yes.
SOCRATES : Then it looks as if this man were considering something which
he knows as if he did not know it (for we have granted that he knows all
numbers). I’ve no doubt you’ve had such puzzles put to you.
THEAETETUS : I have, yes.
SOCRATES : Then using our image of possessing and hunting for the pi- d
geons, we shall say that there are two phases of hunting; one before you220 Theaetetus
have possession in order to get possession, and another when you already
possess in order to catch and have in your hands what you previously
acquired. And in this way even with things you learned and got the
knowledge of long ago and have known ever since, it is possible to learn
them —these same things —all over again. You can take up again and ‘have’
that knowledge of each of them which you acquired long ago but had not
ready to hand in your thought, can’t you?
THEAETETUS : True.
SOCRATES : Now this is what I meant by my question a moment ago. e
What terms ought we to use about them when we speak of what the
arithmetician does when he proceeds to count, or the scholar when he
proceeds to read something? Here, it seems, a man who knows something
is setting out to learn again from himself things which he already knows.
THEAETETUS : But that would be a very odd thing, Socrates.
SOCRATES : But are we to say that it is things which he does not know
that such a man is going to read and count —remembering that we have 199
granted him knowledge of all letters and all numbers?
THEAETETUS : That wouldn’t be reasonable, either.
SOCRATES : Then would you like us to take this line? Suppose we say we
do not mind at all about the names; let people drag around the terms
‘knowing’ and ‘learning’ to their heart’s content. We have determined that
to‘possess’ knowledge is one thing and to ‘have’ it is another; accordingly
we maintain that it is impossible for anyone not to possess that which he
has possession of, and thus, it never happens that he does not know
something he knows. But he may yet make a false judgment about it. This
is because it is possible for him to ‘have’, not the knowledge of this thing, b
but another piece of knowledge instead. When he is hunting for one piece
of knowledge, it may happen, as they ﬂy about, that he makes a mistake
and gets hold of one instead of another. It was this that happened when
he thought eleven was twelve. He got hold of the knowledge of eleven
that was in him, instead of the knowledge of twelve, as you might catch
a ring-dove instead of a pigeon.
THEAETETUS : Yes; that is reasonable, now.
SOCRATES : But when he gets hold of the one he is trying to get hold of,
then he is free from error; when he does that, he is judging what is. In
this way, both true and false judgment exist; and the things that worried c
us before no longer stand in our way. I daresay you’ll agree with me? Or,
if not, what line will you take?
THEAETETUS : I agree.
SOCRATES : Yes; we have now got rid of this ‘not knowing what one
knows’. For we now ﬁnd that at no point does it happen that we do not
possess what we possess, whether we are in error about anything or not.
But it looks to me as if something else more alarming is by way of coming
upon us.
THEAETETUS : What’s that?Theaetetus 221
SOCRATES : I mean, what is involved if false judgment is going to become
a matter of an interchange of pieces of knowledge.
THEAETETUS : What do you mean?
SOCRATES : To begin with, it follows that a man who has knowledge of d
something is ignorant of this very thing not through want of knowledge
but actually in virtue of his knowledge. Secondly, he judges that this is
something else and that the other thing is it. Now surely this is utterly
unreasonable; it means that the soul, when knowledge becomes present
to it, knows nothing and is wholly ignorant. According to this argument,
there is no reason why an accession of ignorance should not make one
know something, or of blindness make one see something, if knowledge
is ever going to make a man ignorant.
THEAETETUS : Well, perhaps, Socrates, it wasn’t a happy thought to make e
the birds only pieces of knowledge. Perhaps we ought to have supposed
that there are pieces of ignorance also ﬂying about in the soul along with
them, and what happens is that the hunter sometimes catches a piece of
knowledge and sometimes a piece of ignorance concerning the same thing;
and the ignorance makes him judge falsely, while the knowledge makes
him judge truly.
SOCRATES : I can hardly refrain from expressing my admiration of you,
Theaetetus; but do think again about that. Let us suppose it is as you say:
then, you maintain, the man who catches a piece of ignorance will judge 200
falsely. Is that it?
THEAETETUS : Yes.
SOCRATES : But presumably he will not think he is judging falsely?
THEAETETUS : No, of course he won’t.
SOCRATES : He will think he is judging what is true; and his attitude
towards the things about which he is in error will be as if he knew them.
THEAETETUS : Of course.
SOCRATES : He will think he has hunted down and ‘has’ a piece of knowl-
edge and not a piece of ignorance.
THEAETETUS : Yes, that’s clear.
SOCRATES : So, after going a long way round, we are back at our original
difﬁculty. Our friend the expert in refutation will laugh. ‘My very good b
people,’ he will say, ‘do you mean that a man who knows both knowledge
and ignorance is thinking that one of them which he knows is the other
which he knows? Or is it that he knows neither, and judges the one he
doesn’t know to be the other which he doesn’t know? Or is it that he
knows one and not the other, and judges that the one he knows is the one
he doesn’t know? Or does he think that the one he doesn’t know is the
one he does? Or are you going to start all over again and tell me that
there’s another set of pieces of knowledge concerning pieces of knowledge
and ignorance, which a man may possess shut up in some other ridiculous
aviaries or waxen devices, which he knows so long as he possesses them c
though he may not have them ready to hand in his soul —and in this way222 Theaetetus
end up forced to come running round to the same place over and over again
and never get any further?’ What are we going to say to that, Theaetetus?
THEAETETUS : Oh, dear me, Socrates, I don’t know what one ought to say.
SOCRATES : Then don’t you think, my boy, that the argument is perhaps
dealing out a little proper chastisement, and showing us that we were
wrong to leave the question about knowledge and proceed to inquire into d
false judgment ﬁrst? While as a matter of fact it’s impossible to know this
until we have an adequate grasp of what knowledge is.
THEAETETUS : Well, at the moment, Socrates, I feel bound to believe you.
SOCRATES : Then, to go back to the beginning, what are we going to say
knowledge is?—We are not, I suppose, going to give up yet?
THEAETETUS : Certainly not, unless you give up yourself.
SOCRATES : Tell me, then, how could we deﬁne it with the least risk of
contradicting ourselves?
THEAETETUS : In the way we were attempting before, Socrates; I can’t e
think of any other.
SOCRATES : In what way do you mean?
THEAETETUS : By saying that knowledge is true judgment. Judging truly
is at least something free of mistakes, I take it, and everything that results
from it is admirable and good.
SOCRATES : Well, Theaetetus, as the man who was leading the way across
the river said, ‘It will show you.’37If we go on and track this down, perhaps 201
we may stumble on what we are looking for; if we stay where we are,
nothing will come clear.
THEAETETUS : You’re right; let’s go on and consider it.
SOCRATES : Well, this won’t take long to consider, anyway; there is a
whole art indicating to you that knowledge is not what you say.
THEAETETUS : How’s that? What art do you mean?
SOCRATES : The art of the greatest representatives of wisdom—the men
called orators and lawyers. These men, I take it, use their art to produce
conviction not by teaching people, but by making them judge whatever
they themselves choose. Or do you think there are any teachers so clever
that within the short time allowed by the clock they can teach adequately b
to people who were not eye-witnesses the truth of what happened to
people who have been robbed or assaulted?
THEAETETUS : No, I don’t think they possibly could; but they might be
able to persuade them.
SOCRATES : And by ‘persuading them’, you mean ‘causing them to judge’,
don’t you?
THEAETETUS : Of course.
SOCRATES : Then suppose a jury has been justly persuaded of some matter
which only an eye-witness could know, and which cannot otherwise be
37. According to the scholiast the story was: some travellers came to the bank of a river,
which they wished to cross at the ford; one of them asked the guide, ‘Is the water deep?’
He said, ‘It will show you’, i.e., you must try it for yourself.Theaetetus 223
known; suppose they come to their decision upon hearsay, forming a c
true judgment: then they have decided the case without knowledge, but,
granted they did their job well, being correctly persuaded?
THEAETETUS : Yes, certainly.
SOCRATES : But, my dear lad, they couldn ’t have done that if true judgment
is the same thing as knowledge; in that case the best juryman in the world
couldn’t form a correct judgment without knowledge. So it seems they
must be different things.
THEAETETUS : Oh, yes, Socrates, that ’s just what I once heard a man say;
I had forgotten, but now it ’s coming back to me. He said that it is true d
judgment with an account38that is knowledge; true judgment without an
account falls outside of knowledge. And he said that the things of which
there is no account are not knowable (yes, he actually called them that),39
while those which have an account are knowable.
SOCRATES : Very good indeed. Now tell me, how did he distinguish these
knowables and unknowables? I want to see if you and I have heard the
same version.
THEAETETUS : I don’t know if I can ﬁnd that out; but I think I could follow
if someone explained it.
SOCRATES : Listen then to a dream in return for a dream. In my dream,
too, I thought I was listening to people saying that the primary elements, e
as it were, of which we and everything else are composed, have no account.
Each of them, in itself, can only be named; it is not possible to say anything
else of it, either that it is or that it is not. That would mean that we were 202
adding being or not-being to it; whereas we must not attach anything, if
we are to speak of that thing itself alone. Indeed we ought not to apply
to it even such words as ‘itself’ or‘that’, ‘each’, ‘alone’,o r‘this’,o ra n y
other of the many words of this kind; for these go the round and are
applied to all things alike, being other than the things to which they are
added, whereas if it were possible to express the element itself and it had
its own proprietary account, it would have to be expressed without any
other thing. As it is, however, it is impossible that any of the primaries b
should be expressed in an account; it can only be named, for a name is
all that it has. But with the things composed of these, it is another matter.
Here, just in the same way as the elements themselves are woven together,
so their names may be woven together and become an account of some-
thing —an account being essentially a complex of names. Thus the elements
are unaccountable and unknowable, but they are perceivable, whereas the
38.‘Account’ translates logos, which can also mean ‘statement,’‘ argument’, ‘speech’,
and ‘discourse’.
39. The parenthesis may alternatively be translated: ‘(that was the word he used) ’. The
translation in the text expresses surprise about the claim that some things are not know-
able at all. The alternative translation calls attention to the particular Greek word used
for‘knowable’.224 Theaetetus
complexes are both knowable and expressible and can be the objects of
true judgment.
Now when a man gets a true judgment about something without an c
account, his soul is in a state of truth as regards that thing, but he does
not know it; for someone who cannot give and take an account of a thing
is ignorant about it. But when he has also got an account of it, he is capable
of all this and is made perfect in knowledge. Was the dream you heard
the same as this or a different one?
THEAETETUS : No, it was the same in every respect.
SOCRATES : Do you like this then, and do you suggest that knowledge is
true judgment with an account?
THEAETETUS : Yes, certainly.
SOCRATES : Theaetetus, can it be that all in a moment, you and I have d
today laid hands upon something which many a wise man has searched
for in the past —and gone gray before he found it?
THEAETETUS : Well, it does seem to me anyway, Socrates, that what has
just been said puts the matter very well.
SOCRATES : And it seems likely enough that the matter is really so; for what
knowledge could there be apart from an account and correct judgment? But
there is one of the things said which I don ’t like.
THEAETETUS : And what’s that?
SOCRATES : What looks like the subtlest point of all —that the elements
are unknowable and the complexes knowable. e
THEAETETUS : And won’t that do?
SOCRATES : We must make sure; because, you see, we do have as hostages
for this theory the original models that were used when all these statements
were made.
THEAETETUS : What models?
SOCRATES : Letters —the elements of language —and syllables.40It must
have been these, mustn’t it, that the author of our theory had in view —
it couldn’t have been anything else?
THEAETETUS : No, he must have been thinking of letters and syllables.
SOCRATES : Let’s take and examine them then. Or rather let us examine 203
ourselves, and ask ourselves whether we really learned our letters in this
way or not. Now, to begin with, one can give an account of the syllables
but not of the letters —is that it?
THEAETETUS : Well, perhaps.
SOCRATES : It most certainly looks like that to me. At any rate, supposing
you were asked about the ﬁrst syllable of ‘Socrates’: ‘Tell me, Theaetetus,
what is SO?’ What would you answer to that?
THEAETETUS : That it’s S and O.
SOCRATES : And there you have an account of the syllable?
40.‘Letters’ translates stoicheia, which can also mean ‘elements’ more generally (and
is so translated sometimes below). ‘Syllables’: in Greek sullabai, also translated below
as‘complexes.’Theaetetus 225
THEAETETUS : Yes.
SOCRATES : Come along then, and let us have the account of S in the b
same way.
THEAETETUS : How cananyone give the letters of a letter? S is just one of
the voiceless letters, Socrates, a mere sound like a hissing of the tongue.
B again has neither voice nor sound, and that ’s true of most letters. So the
statement that they themselves are unaccountable holds perfectly good.
Even the seven clearest have only voice; no sort of account whatever can
be given of them.41
SOCRATES : So here, my friend, we have established a point about
knowledge.
THEAETETUS : We do appear to have done so.
SOCRATES : Well then: we have shown that the syllable is knowable but c
not the letter —is that all right?
THEAETETUS : It seems the natural conclusion, anyway.
SOCRATES : Look here, what do we mean by ‘the syllable’? The two letters
(or if there are more, all the letters)? Or do we mean some single form
produced by their combination?
THEAETETUS : I think we mean all the letters.
SOCRATES : Then take the case of the two letters, S and O; these two are
theﬁrst syllable of my name. If a man knows the syllable, he must know
both the letters?
THEAETETUS : Of course. d
SOCRATES : So he knows S and O.
THEAETETUS : Yes.
SOCRATES : But can it be that he is ignorant of each one, and knows the
two of them without knowing either?
THEAETETUS : That would be a strange and unaccountable thing, Socrates.
SOCRATES : And yet, supposing it is necessary to know each in order to
know both, then it is absolutely necessary that anyone who is ever to know
a syllable must ﬁrst get to know the letters. And in admitting this, we
shall ﬁnd that our beautiful theory has taken to its heels and got clean
away from us.
THEAETETUS : And very suddenly too. e
SOCRATES : Yes; we are not keeping a proper watch on it. Perhaps we
ought not to have supposed the syllable to be the letters; perhaps we ought
to have made it some single form produced out of them, having its own
single nature —something different from the letters.
THEAETETUS : Yes, certainly; that might be more like it.
SOCRATES : We must look into the matter; we have no right to betray a
great and imposing theory in this faint-hearted manner.
THEAETETUS : Certainly not.
41. I.e., the seven vowels of ancient Greek, as contrasted with two classes of consonant:
mutes like B, which cannot be pronounced without a vowel, and semivowels like S,
which can.226 Theaetetus
SOCRATES : Then let it be as we are now suggesting. Let the complex be 204
a single form resulting from the combination of the several elements when
they ﬁt together; and let this hold both of language and of things in general.
THEAETETUS : Yes, certainly.
SOCRATES : Then it must have no parts.
THEAETETUS : Why is that, now?
SOCRATES : Because when a thing has parts, the whole is necessarily all
the parts. Or do you mean by ‘the whole’ also a single form arising out
of the parts, yet different from all the parts?
THEAETETUS : I do.
SOCRATES : Now do you call ‘sum’42and ‘whole’ the same thing or differ- b
ent things?
THEAETETUS : I don’t feel at all certain; but as you keep telling me to
answer up with a good will, I will take a risk and say they are different.
SOCRATES : Your good will, Theaetetus, is all that it should be. Now we
must see if your answer is too.
THEAETETUS : We must, of course.
SOCRATES : As the argument stands at present, the whole will be different
from the sum?
THEAETETUS : Yes.
SOCRATES : Well now, is there any difference between all the things and
the sum? For instance, when we say ‘one, two, three, four, ﬁve, six’; or, c
‘twice three’,o r‘three times two’, ‘four and two’, ‘three and two and one ’;
are we speaking of the same thing in all these cases or different things?
THEAETETUS : The same thing.
SOCRATES : That is, six?
THEAETETUS : Precisely.
SOCRATES : Then with each expression have we not spoken of all the six?
THEAETETUS : Yes.
SOCRATES : And when we speak of them all, aren’t we speaking of a sum?
THEAETETUS : We must be.
SOCRATES : That is, six?
THEAETETUS : Precisely.
SOCRATES : Then in all things made up of number, at any rate, by ‘the d
sum’ and ‘all of them’ we mean the same thing?
THEAETETUS : So it seems.
SOCRATES : Now let us talk about them in this way. The number of an
acre is the same thing as an acre, isn ’t it?
THEAETETUS : Yes.
SOCRATES : Similarly with a mile.
THEAETETUS : Yes.
42. The word translated ‘sum’ (pan) and the word translated ‘all’ (panta) in the phrase
‘all the parts ’are singular and plural forms of the same Greek word.Theaetetus 227
SOCRATES : And the number of an army is the same as the army? And
so always with things of this sort; their total number is the sum that each
of them is.
THEAETETUS : Yes.
SOCRATES : But is the number of each anything other than its parts? e
THEAETETUS : No.
SOCRATES : Now things which have parts consist of parts?
THEAETETUS : That seems true.
SOCRATES : And it is agreed that all the parts are the sum, seeing that the
total number is to be the sum.
THEAETETUS : That is so.
SOCRATES : Then the whole does not consist of parts. For if it did, it would
be all the parts and so would be a sum.
THEAETETUS : It looks as if it doesn ’t.
SOCRATES : But can a part, as such, be a part of anything but the whole?
THEAETETUS : Yes; of the sum.
SOCRATES : You are putting up a good ﬁght anyway, Theaetetus. But this 205
sum now —isn’t it just when there is nothing lacking that it is a sum?
THEAETETUS : Yes, necessarily.
SOCRATES : And won’t this very same thing —that from which nothing
anywhere is lacking —be a whole? While a thing from which something
is absent is neither a whole nor a sum —the same consequence having
followed from the same condition in both cases at once?
THEAETETUS : Well, it doesn ’t seem to me now that there can be any
difference between whole and sum.
SOCRATES : Very well. Now were we not saying43that in the case of a
thing that has parts, both the whole and the sum will be all the parts?
THEAETETUS : Yes, certainly.
SOCRATES : Now come back to the thing I was trying to get at just now.44
Supposing the syllable is not just its letters, doesn ’t it follow that it cannot b
contain the letters as parts of itself? Alternatively, if it is the same as the
letters, it must be equally knowable with them?
THEAETETUS : That is so.
SOCRATES : Well, wasn ’t it just in order to avoid this result that we sup-
posed it different from the letters?
THEAETETUS : Yes.
SOCRATES : Well then, if the letters are not parts of the syllable, can you
tell me of any other things, not its letters, which are?
THEAETETUS : No, indeed. If I were to admit that it had component parts,
Socrates, it would be ridiculous, of course, to set aside the letters and look
for other components.
43. At 204a.
44. See 203d –e.228 Theaetetus
SOCRATES : Then, Theaetetus, according to our present argument, a sylla- c
ble is an absolutely single form, indivisible into parts.
THEAETETUS : It looks like it.
SOCRATES : Now, my friend, a little while ago, if you remember, we were
inclined to accept a certain proposition which we thought put the matter
very well —I mean the statement that no account can be given of the
primaries of which other things are constituted, because each of them is
in itself incomposite; and that it would be incorrect to apply even the term
‘being’ to it when we spoke of it or the term ‘this’, because these terms
signify different and alien things; and that is the reason why a primary is
an unaccountable and unknowable thing. Do you remember?
THEAETETUS : I remember.
SOCRATES : And is that the reason also why it is single in form and d
indivisible into parts or is there some other reason for that?45I can see no
other myself.
THEAETETUS : No, there really doesn ’t seem to be any other.
SOCRATES : And hasn ’t the complex now fallen into the same class as the
primary, seeing it has no parts and is a single form?
THEAETETUS : Yes, it certainly has.
SOCRATES : Well now, if the complex is both many elements and a whole,
with them as its parts, then both complexes and elements are equally
capable of being known and expressed, since all the parts turned out to
be the same thing as the whole.
THEAETETUS : Yes, surely. e
SOCRATES : But if, on the other hand, the complex is single and without
parts, then complexes and elements are equally unaccountable and un-
knowable —both of them for the same reason.
THEAETETUS : I can’t dispute that.
SOCRATES : Then if anyone tries to tell us that the complex can be known
and expressed, while the contrary is true of the element, we had better
not listen to him.
THEAETETUS : No, we’d better not, if we go along with the argument.
SOCRATES : And, more than this, wouldn ’t you more easily believe some- 206
body who made the contrary statement, because of what you know of
your own experience in learning to read and write?
THEAETETUS : What kind of thing do you mean?
SOCRATES : I mean that when you were learning you spent your time just
precisely in trying to distinguish, by both eye and ear, each individual
letter in itself so that you might not be bewildered by their different
positions in written and spoken words.
THEAETETUS : That’s perfectly true.
45. Alternatively (accepting the conjecture of tofortouto at 205d): ‘And is there any
other reason for this than that it is single in form and indivisible into parts? ’Theaetetus 229
SOCRATES : And at the music-teacher ’s, wasn’t the ﬁnished pupil the one
who would follow each note and tell to which string it belonged —the b
notes being generally admitted to be the elements in music?
THEAETETUS : Yes, that’s just what it amounted to.
SOCRATES : Then if the proper procedure is to take such elements and
complexes as we ourselves have experience of, and make an inference
from them to the rest, we shall say that the elements are much more clearly
known, and the knowledge of them is more decisive for the mastery of
any branch of study than knowledge of the complex. And if anyone main-
tains that the complex is by nature knowable, and the element unknowable,
we shall regard this as tomfoolery, whether it is intended to be or not.
THEAETETUS : Oh, quite.
SOCRATES : I think that might be proved in other ways too. But we mustn ’t c
let them distract us from the problem before us. We wanted to see what
can be meant by the proposition that it is in the addition of an account to
a true judgment that knowledge is perfected.
THEAETETUS : Well yes, we must try to see that.
SOCRATES : Come then, what are we intended to understand by an ‘ac-
count’? I think it must be one of three meanings.
THEAETETUS : What are they?
SOCRATES : The ﬁrst would be, making one’s thought apparent vocally d
by means of words and verbal expressions —when a man impresses an
image of his judgment upon the stream of speech, like re ﬂections upon
water or in a mirror. Don ’t you think this kind of thing is an account?
THEAETETUS : Yes, I do. At least, a man who does this is said to be giving
an account.46
SOCRATES : But isn’t that a thing that everyone is able to do more or less
readily —I mean, indicate what he thinks about a thing, if he is not deaf
or dumb to begin with? And that being so, anyone at all who makes a
correct judgment will turn out to have it ‘together with an account ’; correct e
judgment without knowledge will no longer be found anywhere.
THEAETETUS : True.
SOCRATES : Well then, we mustn’t be too ready to condemn the author
of the de ﬁnition of knowledge now before us for talking nonsense. Perhaps
he didn’t mean this; perhaps he meant being able, when questioned about 207
what a thing is, to give an answer by reference to its elements.
THEAETETUS : As for example, Socrates?
SOCRATES : As for example, what Hesiod is doing when he says, ‘One
hundred are the timbers of a wagon. ’47Now I couldn’t say what they are;
and I don’t suppose you could either. If you and I were asked what a
46.‘Giving an account’ here translates legein, the ordinary Greek word for ‘say, speak,
speak of ’, which corresponds to logos in its wider meanings ‘speech, discourse, statement ’.
47.Works and Days 456.230 Theaetetus
wagon is, we should be satisﬁed if we could answer, ‘Wheels, axle, body,
rails, yoke.’
THEAETETUS : Yes, surely.
SOCRATES : But he might think us ridiculous, just as he would if we were
asked what your name is, and replied by giving the syllables. In that case,
he would think us ridiculous because although we might be correct in our b
judgment and our expression of it, we should be fancying ourselves as
scholars, thinking we knew and were expressing a scholar’s account of
Theaetetus’ name. Whereas in fact no one gives an account of a thing with
knowledge till, in addition to his true judgment, he goes right through
the thing element by element —as I think we said before.
THEAETETUS : We did, yes.
SOCRATES : In the same way, in the example of the wagon, he would say
that we have indeed correct judgment; but it is the man who can explore c
its being by going through those hundred items who has made the addition
which adds an account to his true judgment. It is this man who has passed
from mere judgment to expert knowledge of the being of a wagon; and
he has done so in virtue of having gone over the whole by means of
the elements.
THEAETETUS : And doesn’t that seem sound to you, Socrates?
SOCRATES : Well, tell me if it seems sound to you, my friend. Tell me if
you are prepared to accept the view that an account is a matter of going
through a thing element by element, while going through it by ‘syllables’
or larger divisions falls short of being an account. Then we shall be able d
to discuss it.
THEAETETUS :I’m certainly prepared to accept that.
SOCRATES : And do you at the same time think that a man has knowledge
of anything when he believes the same thing now to be part of one thing
and now part of something else? Or when he judges that now one thing
and now something different belongs to one and the same object?
THEAETETUS : No, indeed I don’t.
SOCRATES : Then have you forgotten that at ﬁrst when you were learning
to read and write that is just what you and the other boys used to do?
THEAETETUS : You mean we used to think that sometimes one letter
and sometimes another belonged to the same syllable, and used to e
put the same letter sometimes into its proper syllable and sometimes
into another?
SOCRATES : Yes, that is what I mean.
THEAETETUS : Well, I certainly haven’t forgotten; and I don’t think people
at that stage can be said to have knowledge yet.
SOCRATES : Well, suppose now that someone who is at this sort of stage
is writing the name ‘Theaetetus’; he thinks he ought to write THE and
does so. Then suppose another time he is trying to write ‘Theodorus’, and 208
this time he thinks he should write TE and proceeds to do so. Are we
going to say that he knows the ﬁrst syllable of your names?Theaetetus 231
THEAETETUS : No. We’ve admitted that anyone who is at that stage has
not yet knowledge.
SOCRATES : And is there anything to prevent the same person being in
that situation as regards the second and third and fourth syllables?
THEAETETUS : No, nothing.
SOCRATES : Now at the time when he does this, he will be writing ‘Theaete-
tus’not only with correct judgment, but with command of the way through
its letters; that must be so whenever he writes them out one after another
in their order.
THEAETETUS : Yes, clearly.
SOCRATES : And still without knowledge though with correct judgment — b
isn’t that our view?
THEAETETUS : Yes.
SOCRATES : Yet possessing an account of it along with his correct judgment.
He was writing it, you see, with command of the way through its letters;
and we agreed that that is an account.
THEAETETUS : True.
SOCRATES : So here, my friend, we have correct judgment together with
an account, which we are not yet entitled to call knowledge.
THEAETETUS : Yes, I’m afraid that’s so.
SOCRATES : So it was only the poor man’s dream of gold that we had
when we thought we had got the truest account of knowledge. Or is it
early days to be harsh? Perhaps this is not the way in which one is to c
deﬁne ‘account’. We said that the man who deﬁnes knowledge as correct
judgment together with an account would choose one of three meanings
for‘account’. Perhaps the last is the one to deﬁne it by.
THEAETETUS : Yes, you’re right to remind me; there is one possibility still
left. The ﬁrst was, a kind of vocal image of thought; the one we have just
discussed was the way to the whole through the elements. Now what’s
your third suggestion?
SOCRATES : What the majority of people would say —namely, being able
to tell some mark by which the object you are asked about differs from
all other things.
THEAETETUS : Can you give me an example of such an ‘account’ of some-
thing?
SOCRATES : Well, take the sun, if you like. You would be satisﬁed, I d
imagine, with the answer that it is the brightest of the bodies that move
round the earth in the heavens.
THEAETETUS : Oh yes, quite.
SOCRATES : Now I want you to get hold of the principle that this illustrates.
It is what we were just saying —that if you get hold of the difference that
distinguishes a thing from everything else, then, so some people say, you
will have got an account of it. On the other hand, so long as it is some
common feature that you grasp, your account will be about all those things
which have this in common.232 Theaetetus
THEAETETUS : I see; I think it’s very good to call this kind of thing an ac- e
count.
SOCRATES : Then if a man with correct judgment about any one of the
things that are grasps in addition its difference from the rest, he has become
a knower of the thing he was a judger of before.
THEAETETUS : That’s our present position, anyway.
SOCRATES : Well, at this point, Theaetetus, as regards what we are saying,
I’m for all the world like a man looking at a shadow-painting;48when I’m
close up to it I can’t take it in in the least, though when I stood well back
from it, it appeared to me to have some meaning.
THEAETETUS : How’s that?
SOCRATES : I’ll see if I can explain. Suppose I have formed a correct 209
judgment about you; if I can grasp your account in addition, I know you,
but if not, I am merely judging you.
THEAETETUS : Yes.
SOCRATES : And an account was to be a matter of expounding your differ-
entness?
THEAETETUS : That is so.
SOCRATES : Then when I was merely judging, my thought failed to grasp
any point of difference between you and the rest of mankind?
THEAETETUS : Apparently.
SOCRATES : What I had in mind, it seems, was some common characteris-
tic—something that belongs no more to you than to anybody else.
THEAETETUS : Yes, that must be so. b
SOCRATES : Then tell me, in Heaven’s name how, if that was so, did it
come about that you were the object of my judgment and nobody else?
Suppose my thought is that ‘This is Theaetetus—one who is a human
being, and has a nose and eyes and mouth’, and so on through the whole
list of limbs. Will this thought cause me to be thinking of Theaetetus rather
than of Theodorus, or of the proverbial ‘remotest Mysian’?
THEAETETUS : No, how could it?
SOCRATES : But suppose I think not merely of ‘the one with nose and
eyes’, but of ‘the one with a snub nose and prominent eyes’. Shall I even c
then be judging you any more than myself or anyone who is like that?
THEAETETUS : Not at all.
SOCRATES : It will not, I take it, be Theaetetus who is judged in my mind
until this snub-nosedness of yours has left imprinted and established in
me a record that is different in some way from the other snub-nosednesses
I have seen; and so with the other details of your makeup. And this
will remind me, if I meet you tomorrow, and make me judge correctly
about you.
48. The pictorial technique referred to ( skiagraphia) seems to have been one which de-
pended on contrasts between light and shade to create the appearance of form and
volume. A more familiar comparison for modern readers would be a pointilliste painting
by Seurat.Theaetetus 233
THEAETETUS : That’s perfectly true.
SOCRATES : Then correct judgment also must be concerned with the differ- d
entness of what it is about?
THEAETETUS : So it seems, anyway.
SOCRATES : Then what more might this ‘adding an account to correct
judgment’ be? If, on the one hand, it means that we must make another
judgment about the way in which a thing differs from the rest of things,
we are being required to do something very absurd.
THEAETETUS : How’s that?
SOCRATES : Because we already have a correct judgment about the way
a thing differs from other things; and we are then directed to add a correct
judgment about the way it differs from other things. At that rate, the way
a roller goes round or a pestle or anything else proverbial would be nothing e
compared with such directions; they might be more justly called a matter
of‘the blind leading the blind’. To tell us to add what we already have,
in order to come to know what we are judging about, bears a generous
resemblance to the behavior of a man benighted.
THEAETETUS : Whereas if, on the other hand, ...?49What else were you
going to suggest when you started this inquiry just now?
SOCRATES : Well, if ‘adding an account’ means that we are required to
get to know the differentness, not merely judge it, this most splendid of
our accounts of knowledge turns out to be a very amusing affair. For 210
getting to know of course is acquiring knowledge, isn ’t it?
THEAETETUS : Yes.
SOCRATES : So, it seems, the answer to the question ‘What is knowledge?’
will be ‘Correct judgment accompanied by knowledge of the differentness’—
for this is what we are asked to understand by the ‘addition of an account. ’
THEAETETUS : Apparently so.
SOCRATES : And it is surely just silly to tell us, when we are trying to
discover what knowledge is, that it is correct judgment accompanied by
knowledge, whether of differentness or of anything else? And so, Theaetetus,
knowledge is neither perception nor true judgment, nor an account added b
to true judgment.
THEAETETUS : It seems not.
SOCRATES : Well now, dear lad, are we still pregnant, still in labor with
any thoughts about knowledge? Or have we been delivered of them all?
THEAETETUS : As far as I’m concerned, Socrates, you’ve made me say far
more than ever was in me, Heaven knows.
SOCRATES : Well then, our art of midwifery tells us that all of these off-
spring are wind-eggs and not worth bringing up?
THEAETETUS : Undoubtedly.
SOCRATES : And so, Theaetetus, if ever in the future you should attempt
to conceive or should succeed in conceiving other theories, they will be c
better ones as the result of this inquiry. And if you remain barren, your
49. Reading Ei ge de ¯...forEipe de ¯at 209e5.234 Theaetetus
companions will ﬁnd you gentler and less tiresome; you will be modest
and not think you know what you don’t know. This is all my art can
achieve —nothing more. I do not know any of the things that other men
know —the great and inspired men of today and yesterday. But this art
of midwifery my mother and I had allotted to us by God; she to deliver
women, I to deliver men that are young and generous of spirit, all that 210d
have any beauty. And now I must go to the King’s Porch to meet the
indictment that Meletus has brought against me; but let us meet here again
in the morning, Theodorus."
}
]